<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>IMPLEMENTACI&Oacute;N DE UN MAPA DE CONOCIMIENTO SOBRE PLATAFORMA WEB USANDO ONTOLOG&Iacute;AS PARA GESTI&Oacute;N DE CONOCIMIENTO ORGANIZACIONAL</title><link rel="stylesheet" type="text/css" href="style.css"><meta name="generator" content="DocBook XSL Stylesheets V1.77.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="book"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>
		IMPLEMENTACI&Oacute;N DE UN MAPA DE CONOCIMIENTO SOBRE PLATAFORMA WEB USANDO 
		ONTOLOG&Iacute;AS PARA GESTI&Oacute;N DE CONOCIMIENTO ORGANIZACIONAL</h1></div><div><div class="author"><h3 class="author"><span class="firstname">
		Daniel</span> <span class="surname">
		Ben&iacute;tez Restrepo</span></h3></div></div><div><p class="copyright">Copyright &copy; 
		2012 Universidad de Caldas (Manizales - Colombia)</p></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="glossary"><a href="#d5e11">GLOSARIO</a></span></dt><dt><span class="chapter"><a href="#d5e227">1. 
		RESUMEN</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e236">
			Palabras clave</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e244">2. 
		INTRODUCCI&Oacute;N</a></span></dt><dt><span class="chapter"><a href="#d5e267">3. 
		DEFINICI&Oacute;N DEL PROBLEMA</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e269">
			ANTECEDENTES</a></span></dt><dt><span class="section"><a href="#d5e365">
			FORMULACI&Oacute;N</a></span></dt><dt><span class="section"><a href="#d5e371">
			DESCRIPCI&Oacute;N</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e392">4. 
		JUSTIFICACI&Oacute;N</a></span></dt><dt><span class="chapter"><a href="#d5e416">5. 
		OBJETIVOS</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e418">
			OBJETIVO GENERAL</a></span></dt><dt><span class="section"><a href="#d5e423">
			OBJETIVOS ESPEC&Iacute;FICOS</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e457">6. 
		MARCO TE&Oacute;RICO</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e459">
			MARCO CONCEPTUAL</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e461">
				GESTI&Oacute;N DEL CONOCIMIENTO (KM), MAPAS DE CONOCIMIENTO (KMap) Y 
				ONTOLOG&Iacute;AS</a></span></dt><dt><span class="section"><a href="#d5e518">
				EST&Aacute;NDARES, WEB Y LENGUAJES DE MARCAS</a></span></dt><dt><span class="section"><a href="#d5e802">
				RESOURCE DESCRIPTION FRAMEWORK (RDF), ONTOLOG&Iacute;AS Y WEB 
				SEM&Aacute;NTICA</a></span></dt><dt><span class="section"><a href="#d5e993">
				FRAMEWORKS Y Yii FRAMEWORK</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1024">
			ENTORNO Y STACK DE COMPONENTES (XAMPP)</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e1039">7. 
		DESARROLLO DEL PROYECTO</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e1041">
			INICIO</a></span></dt><dt><span class="section"><a href="#d5e1051">
			PLANEACI&Oacute;N</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e1053">
				ESTRUCTURA DE DESCOMPOSICI&Oacute;N DEL TRABAJO (WBS)</a></span></dt><dt><span class="section"><a href="#d5e1055">
				TABLA DE PRECEDENCIAS</a></span></dt><dt><span class="section"><a href="#d5e1065">
				RUTA CR&Iacute;TICA</a></span></dt><dt><span class="section"><a href="#d5e1077">
				DIAGRAMA DE GANTT</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1089">
			EJECUCI&Oacute;N</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e1091">
				PLANEACI&Oacute;N DE RIESGOS</a></span></dt><dt><span class="section"><a href="#d5e1130">
				CASOS DE USO</a></span></dt><dt><span class="section"><a href="#d5e1186">
				CONSTRUCCI&Oacute;N DE LA ONTOLOG&Iacute;A</a></span></dt><dt><span class="section"><a href="#d5e1578">
				MODELO DE DATOS</a></span></dt><dt><span class="section"><a href="#d5e1597">
				MVC, DIAGRAMAS Y FLUJO SEG&Uacute;N Yii FRAMEWORK</a></span></dt><dt><span class="section"><a href="#d5e1654">
				INSTALACI&Oacute;N, IMPLEMENTACI&Oacute;N Y DESPLIEGUE</a></span></dt><dt><span class="section"><a href="#d5e1723">
				LIBRER&Iacute;AS Y HERRAMIENTAS EXTERNAS</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1749">
			CONTROL</a></span></dt><dt><span class="section"><a href="#d5e1752">
			CIERRE</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e1755">8. 
		RESULTADOS</a></span></dt><dt><span class="chapter"><a href="#d5e1779">9. 
		CONCLUSIONES</a></span></dt><dt><span class="bibliography"><a href="#d5e1791">BIBLIOGRAF&Iacute;A</a></span></dt></dl></div>
	
	<div class="glossary"><div class="titlepage"><div><div><h1 class="title"><a name="d5e11"></a>GLOSARIO</h1></div></div></div><div class="glossdiv"><h3 class="title">A</h3><dl><dt><a name="WebApp"></a>APLICACI&Oacute;N WEB</dt><dd><p>en la ingenier&iacute;a de software se denomina aplicaci&oacute;n web a aquellas herramientas que los usuarios pueden utilizar accediendo a un servidor web a trav&eacute;s de Internet o de una intranet mediante un navegador. En otras palabras, es una aplicaci&oacute;n software que se codifica en un lenguaje soportado por los navegadores web en la que se conf&iacute;a la ejecuci&oacute;n al navegador.</p><p>See Also <a class="glossseealso" href="#web page">P&Aacute;GINA WEB</a>, <a class="glossseealso" href="#web site">SITIO WEB</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">C</h3><dl><dt><a name="open source"></a>C&Oacute;DIGO ABIERTO</dt><dd><p>c&oacute;digo abierto (o fuente abierta) es el t&eacute;rmino con el que se conoce al software distribuido y desarrollado libremente. El c&oacute;digo abierto tiene un punto de vista m&aacute;s orientado a los beneficios pr&aacute;cticos de poder acceder al c&oacute;digo, que a las cuestiones &eacute;ticas y morales las cuales se destacan en el software libre.</p></dd></dl></div><div class="glossdiv"><h3 class="title">E</h3><dl><dt><a name="XHTML"></a>EXTENSIBLE HYPERTEXT MARKUP LANGUAGE</dt><dd><p>XHTML, Siglas del ingl&eacute;s eXtensible HyperText Markup Language. XHTML es b&aacute;sicamente HTML expresado como XML v&aacute;lido. Es m&aacute;s estricto a nivel t&eacute;cnico, pero esto permite que posteriormente sea m&aacute;s f&aacute;cil al hacer cambios o buscar errores entre otros. En su versi&oacute;n 1.0, XHTML es solamente la versi&oacute;n XML de HTML, por lo que tiene, b&aacute;sicamente, las mismas funcionalidades, pero cumple las especificaciones, m&aacute;s estrictas, de XML. Su objetivo es avanzar en el proyecto del World Wide Web Consortium de lograr una web sem&aacute;ntica, donde la informaci&oacute;n, y la forma de presentarla est&eacute;n claramente separadas. La versi&oacute;n 1.1 es similar, pero parte a la especificaci&oacute;n en m&oacute;dulos. En sucesivas versiones la W3C planea romper con los tags cl&aacute;sicos tra&iacute;dos de HTML.</p><p>See Also <a class="glossseealso" href="#XML">EXTENSIBLE MARKUP LANGUAGE</a>, <a class="glossseealso" href="#HTML">HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#SGML">STANDARD GENERALIZED MARKUP LANGUAGE</a>.</p></dd><dt><a name="XML"></a>EXTENSIBLE MARKUP LANGUAGE</dt><dd><p>XML, siglas en ingl&eacute;s de eXtensible Markup Language ('lenguaje de marcas extensible'), es un lenguaje de marcas desarrollado por el World Wide Web Consortium (W3C). Deriva del lenguaje SGML y permite definir la gram&aacute;tica de lenguajes espec&iacute;ficos (de la misma manera que HTML es a su vez un lenguaje definido por SGML) para estructurar documentos grandes. A diferencia de otros lenguajes, XML da soporte a bases de datos, siendo &uacute;til cuando varias aplicaciones se deben comunicar entre s&iacute; o integrar informaci&oacute;n. (Bases de datos Silberschatz). XML no ha nacido s&oacute;lo para su aplicaci&oacute;n en Internet, sino que se propone como un est&aacute;ndar para el intercambio de informaci&oacute;n estructurada entre diferentes plataformas. Se puede usar en bases de datos, editores de texto, hojas de c&aacute;lculo y casi cualquier cosa imaginable. XML es una tecnolog&iacute;a sencilla que tiene a su alrededor otras que la complementan y la hacen mucho m&aacute;s grande y con unas posibilidades mucho mayores. Tiene un papel muy importante en la actualidad ya que permite la compatibilidad entre sistemas para compartir la informaci&oacute;n de una manera segura, fiable y f&aacute;cil.</p><p>See Also <a class="glossseealso" href="#XHTML">EXTENSIBLE HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#HTML">HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#SGML">STANDARD GENERALIZED MARKUP LANGUAGE</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">F</h3><dl><dt><a name="framework"></a>FRAMEWORK</dt><dd><p>la palabra inglesa "framework" (marco de trabajo) define, en t&eacute;rminos generales, un conjunto estandarizado de conceptos, pr&aacute;cticas y criterios para enfocar un tipo de problem&aacute;tica particular que sirve como referencia, para enfrentar y resolver nuevos problemas de &iacute;ndole similar. En el desarrollo de software, un framework o infraestructura digital, es una estructura conceptual y tecnol&oacute;gica de soporte definido, normalmente con artefactos o m&oacute;dulos de software concretos, con base a la cual otro proyecto de software puede ser m&aacute;s f&aacute;cilmente organizado y desarrollado. T&iacute;picamente, puede incluir soporte de programas, bibliotecas, y un lenguaje interpretado, entre otras herramientas, para as&iacute; ayudar a desarrollar y unir los diferentes componentes de un proyecto. Representa una arquitectura de software que modela las relaciones generales de las entidades del dominio, y provee una estructura y una especial metodolog&iacute;a de trabajo, la cual extiende o utiliza las aplicaciones del dominio.</p><p>See Also <a class="glossseealso" href="#WebApp">APLICACI&Oacute;N WEB</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">G</h3><dl><dt><a name="KM"></a>GESTI&Oacute;N DE CONOCIMIENTO</dt><dd><p>la gesti&oacute;n del conocimiento (del ingl&eacute;s Knowledge Management) es un concepto aplicado en las organizaciones. Tiene el fin de transferir el conocimiento desde el lugar d&oacute;nde se genera hasta el lugar en d&oacute;nde se va a emplear, e implica el desarrollo de las competencias necesarias al interior de las organizaciones para compartirlo y utilizarlo entre sus miembros, as&iacute; como para valorarlo y asimilarlo si se encuentra en el exterior de estas.</p><p>See Also <a class="glossseealso" href="#GT">GESTI&Oacute;N TECNOL&Oacute;GICA DEL CONOCIMIENTO</a>.</p></dd><dt><a name="GT"></a>GESTI&Oacute;N TECNOL&Oacute;GICA DEL CONOCIMIENTO</dt><dd><p>la Gesti&oacute;n Tecnol&oacute;gica del Conocimiento es el conjunto de procesos y sistemas (computacionales) que permiten a una organizaci&oacute;n generar ventaja competitiva sostenible en el tiempo, mediante la gesti&oacute;n eficiente de su conocimiento.</p><p>See Also <a class="glossseealso" href="#KM">GESTI&Oacute;N DE CONOCIMIENTO</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">H</h3><dl><dt><a name="HTML"></a>HYPERTEXT MARKUP LANGUAGE</dt><dd><p>HTML, siglas de HyperText Markup Language ("lenguaje de marcado de hipertexto"), hace referencia al lenguaje de marcado predominante para la elaboraci&oacute;n de p&aacute;ginas web que se utiliza para describir y traducir la estructura y la informaci&oacute;n en forma de texto, as&iacute; como para complementar el texto con objetos tales como im&aacute;genes. El HTML se escribe en forma de &laquo;etiquetas&raquo;, rodeadas por corchetes angulares (&lt;,&gt;). HTML tambi&eacute;n puede describir, hasta un cierto punto, la apariencia de un documento, y puede incluir un script (por ejemplo JavaScript), el cual puede afectar el comportamiento de navegadores web y otros procesadores de HTML.</p><p>See Also <a class="glossseealso" href="#XHTML">EXTENSIBLE HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#XML">EXTENSIBLE MARKUP LANGUAGE</a>, <a class="glossseealso" href="#SGML">STANDARD GENERALIZED MARKUP LANGUAGE</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">M</h3><dl><dt><a name="KMap"></a>MAPA DE CONOCIMIENTO</dt><dd><p>el Mapa de Conocimiento es un recurso organizacional que Gestiona el Conocimiento Organizacional interrelacionando las principales entidades actrices del modelo de conocimiento organizacional. Presta la funcionalidad de directorio que facilita la localizaci&oacute;n del conocimiento dentro de la organizaci&oacute;n mediante el desarrollo de gu&iacute;as y listados de personas, o documentos, por &aacute;reas de actividad o materias de dominio, que con apoyo de la tecnolog&iacute;a son publicados como directorios o gr&aacute;ficos que muestran en d&oacute;nde se encuentra el conocimiento.</p><p>See Also <a class="glossseealso" href="#KM">GESTI&Oacute;N DE CONOCIMIENTO</a>, <a class="glossseealso" href="#GT">GESTI&Oacute;N TECNOL&Oacute;GICA DEL CONOCIMIENTO</a>.</p></dd><dt><a name="MCO"></a>MODELO DE CONOCIMIENTO ORGANIZACIONAL</dt><dd><p>jerarqu&iacute;a de conceptos y clases que describen los recursos organizacionales en un nivel t&aacute;ctico y estrat&eacute;gico de la pir&aacute;mide de jerarqu&iacute;a organizacional.</p><p>See Also <a class="glossseealso" href="#KMap">MAPA DE CONOCIMIENTO</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">O</h3><dl><dt><a name="ontolog%C3%ADa"></a>ONTOLOG&Iacute;A</dt><dd><p>la ontolog&iacute;a es una parte de la metaf&iacute;sica que estudia lo que hay.</p><p>See Also <a class="glossseealso" href="#SW">WEB SEM&Aacute;NTICA</a>.</p></dd><dt><a name="ontolog%C3%ADa inform%C3%A1tica"></a>ONTOLOG&Iacute;A INFORM&Aacute;TICA</dt><dd><p>el t&eacute;rmino ontolog&iacute;a en inform&aacute;tica hace referencia a la formulaci&oacute;n de un exhaustivo y riguroso esquema conceptual dentro de uno o varios dominios dados; con la finalidad de facilitar la comunicaci&oacute;n y el intercambio de informaci&oacute;n entre diferentes sistemas y entidades. Aunque toma su nombre por analog&iacute;a, &eacute;sta es la diferencia con el punto de vista filos&oacute;fico de la palabra ontolog&iacute;a.</p><p>See Also <a class="glossseealso" href="#RDF">RESOURCE DESCRIPTION FRAMEWORK</a>, <a class="glossseealso" href="#OWL">WEB ONTOLOGY LANGUAGE</a>, <a class="glossseealso" href="#SW">WEB SEM&Aacute;NTICA</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">P</h3><dl><dt><a name="web page"></a>P&Aacute;GINA WEB</dt><dd><p>una p&aacute;gina web es el nombre de un documento o informaci&oacute;n electr&oacute;nica adaptada para la World Wide Web y que puede ser accedida mediante un navegador. Esta informaci&oacute;n se encuentra generalmente en formato HTML o XHTML, y puede proporcionar navegaci&oacute;n a otras p&aacute;ginas web mediante enlaces de hipertexto. Las p&aacute;ginas web frecuentemente incluyen otros recursos como hojas de estilo en cascada, guiones (scripts) e im&aacute;genes digitales, entre otros. Las p&aacute;ginas web pueden estar almacenadas en un equipo local o un servidor web remoto. El servidor web puede restringir el acceso &uacute;nicamente para redes privadas, p. ej., en una intranet corporativa, o puede publicar las p&aacute;ginas en la World Wide Web. El acceso a las p&aacute;ginas web es realizado mediante su transferencia desde servidores utilizando el protocolo de transferencia de hipertexto (HTTP).</p><p>See Also <a class="glossseealso" href="#WebApp">APLICACI&Oacute;N WEB</a>, <a class="glossseealso" href="#web site">SITIO WEB</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">R</h3><dl><dt><a name="RDF"></a>RESOURCE DESCRIPTION FRAMEWORK</dt><dd><p>el Marco de Descripci&oacute;n de Recursos (del ingl&eacute;s Resource Description Framework, RDF) es un framework para metadatos en la World Wide Web (WWW), desarrollado por el World Wide Web Consortium (W3C). Es un lenguaje de objetivo general para representar la informaci&oacute;n en la web (un metadato data model). Es una descripci&oacute;n conceptual.</p><p>See Also <a class="glossseealso" href="#RDFS">RDF SCHEMA</a>, <a class="glossseealso" href="#OWL">WEB ONTOLOGY LANGUAGE</a>.</p></dd><dt><a name="RDFS"></a>RDF SCHEMA</dt><dd><p>RDFS o RDF Schema o Esquema RDF es una extensi&oacute;n sem&aacute;ntica de RDF. Un lenguaje primitivo de ontolog&iacute;as que proporciona los elementos b&aacute;sicos para la descripci&oacute;n de vocabularios. La primera versi&oacute;n fue publicada en abril de 1998 por la W3C, la versi&oacute;n actual de la recomendaci&oacute;n fue publicada en febrero de 2004 tambi&eacute;n por la W3C. Existen actualmente otros lenguajes de ontolog&iacute;as m&aacute;s potentes, como puede ser OWL.</p><p>See Also <a class="glossseealso" href="#RDF">RESOURCE DESCRIPTION FRAMEWORK</a>, <a class="glossseealso" href="#OWL">WEB ONTOLOGY LANGUAGE</a>, <a class="glossseealso" href="#XML Schema">XML SCHEMA</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">S</h3><dl><dt><a name="WS"></a>SERVICIO WEB</dt><dd><p>un servicio web (en ingl&eacute;s, Web services) es una tecnolog&iacute;a que utiliza un conjunto de protocolos y est&aacute;ndares que sirven para intercambiar datos entre aplicaciones. Distintas aplicaciones de software desarrolladas en lenguajes de programaci&oacute;n diferentes, y ejecutadas sobre cualquier plataforma, pueden utilizar los servicios web para intercambiar datos en redes de ordenadores como Internet. La interoperabilidad se consigue mediante la adopci&oacute;n de est&aacute;ndares abiertos. Las organizaciones OASIS y W3C son los comit&eacute;s responsables de la arquitectura y reglamentaci&oacute;n de los servicios Web. Para mejorar la interoperabilidad entre distintas implementaciones de servicios Web se ha creado el organismo WS-I, encargado de desarrollar diversos perfiles para definir de manera m&aacute;s exhaustiva estos est&aacute;ndares.Es una maquina que atiende las peticiones de los clientes web y les env&iacute;a los recursos solicitados.</p><p>See Also <a class="glossseealso" href="#XML">EXTENSIBLE MARKUP LANGUAGE</a>.</p></dd><dt><a name="web server"></a>SERVIDOR WEB</dt><dd><p>un servidor web o servidor HTTP es un programa inform&aacute;tico que procesa una aplicaci&oacute;n del lado del servidor realizando conexiones bidireccionales y/o unidireccionales y s&iacute;ncronas o as&iacute;ncronas con el cliente generando o cediendo una respuesta en cualquier lenguaje o Aplicaci&oacute;n del lado del cliente. El c&oacute;digo recibido por el cliente suele ser compilado y ejecutado por un navegador web. Para la transmisi&oacute;n de todos estos datos suele utilizarse alg&uacute;n protocolo. Generalmente se utiliza el protocolo HTTP para estas comunicaciones, perteneciente a la capa de aplicaci&oacute;n del modelo OSI. El t&eacute;rmino tambi&eacute;n se emplea para referirse al ordenador que ejecuta el programa.</p><p>See Also <a class="glossseealso" href="#web page">P&Aacute;GINA WEB</a>, <a class="glossseealso" href="#web site">SITIO WEB</a>.</p></dd><dt><a name="SI"></a>SISTEMA DE INFORMACI&Oacute;N</dt><dd><p>un sistema de informaci&oacute;n (SI) es un conjunto de elementos orientados al tratamiento y administraci&oacute;n de datos e informaci&oacute;n, organizados y listos para su uso posterior, generados para cubrir una necesidad u objetivo.</p><p>See Also <a class="glossseealso" href="#TI">TECNOLOG&Iacute;AS DE LA INFORMACI&Oacute;N Y LA COMUNICACI&Oacute;N</a>.</p></dd><dt><a name="web site"></a>SITIO WEB</dt><dd><p>un sitio web es una colecci&oacute;n de p&aacute;ginas web relacionadas y comunes a un dominio de Internet o subdominio en la World Wide Web en Internet. Una p&aacute;gina web es un documento HTML/XHTML que es accesible generalmente mediante el protocolo HTTP de Internet. Todos los sitios web p&uacute;blicamente accesibles constituyen una gigantesca World Wide Web de informaci&oacute;n (un gigantesco entramado de recursos de alcance mundial). A las p&aacute;ginas de un sitio web se accede frecuentemente a trav&eacute;s de un URL ra&iacute;z com&uacute;n llamado portada, que normalmente reside en el mismo servidor f&iacute;sico. Los URL organizan las p&aacute;ginas en una jerarqu&iacute;a, aunque los hiperenlaces entre ellas controlan m&aacute;s particularmente c&oacute;mo el lector percibe la estructura general y c&oacute;mo el tr&aacute;fico web fluye entre las diferentes partes de los sitios. Algunos sitios web requieren una subscripci&oacute;n para acceder a algunos o todos sus contenidos. Ejemplos de sitios con subscripci&oacute;n incluyen muchos portales de pornograf&iacute;a en Internet, algunos sitios de noticias, sitios de juegos, foros, servicios de correo electr&oacute;nico basados en web, sitios que proporcionan datos de bolsa de valores e informaci&oacute;n econ&oacute;mica en tiempo real, etc.</p><p>See Also <a class="glossseealso" href="#WebApp">APLICACI&Oacute;N WEB</a>, <a class="glossseealso" href="#web page">P&Aacute;GINA WEB</a>.</p></dd><dt><a name="SGML"></a>STANDARD GENERALIZED MARKUP LANGUAGE</dt><dd><p>SGML son las siglas de Standard Generalized Markup Language o "Est&aacute;ndar de Lenguaje de Marcado Generalizado". Consiste en un sistema para la organizaci&oacute;n y etiquetado de documentos. La Organizaci&oacute;n Internacional de Est&aacute;ndares (ISO) normaliz&oacute; este lenguaje ISO 8879:1986, Information processing &#8212; Text and office systems &#8212; Standard Generalized Markup Language (SGML). El lenguaje SGML sirve para especificar las reglas de etiquetado de documentos y no impone en s&iacute; ning&uacute;n conjunto de etiquetas en especial.</p><p>See Also <a class="glossseealso" href="#XHTML">EXTENSIBLE HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#XML">EXTENSIBLE MARKUP LANGUAGE</a>, <a class="glossseealso" href="#HTML">HYPERTEXT MARKUP LANGUAGE</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">T</h3><dl><dt><a name="TI"></a>TECNOLOG&Iacute;AS DE LA INFORMACI&Oacute;N Y LA COMUNICACI&Oacute;N</dt><dd><p>las tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n (TIC o bien NTIC para nuevas tecnolog&iacute;as de la informaci&oacute;n y de la comunicaci&oacute;n) agrupan los elementos y las t&eacute;cnicas usadas en el tratamiento y la transmisi&oacute;n de la informaci&oacute;n, principalmente la inform&aacute;tica, Internet y las telecomunicaciones.</p><p>See Also <a class="glossseealso" href="#SI">SISTEMA DE INFORMACI&Oacute;N</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">W</h3><dl><dt><a name="OWL"></a>WEB ONTOLOGY LANGUAGE</dt><dd><p>OWL es el acr&oacute;nimo del ingl&eacute;s Web Ontology Language, un lenguaje de marcado para publicar y compartir datos usando ontolog&iacute;as en la WWW. OWL tiene como objetivo facilitar un modelo de marcado construido sobre RDF y codificado en XML. Tiene como antecedente DAML+OIL, en los cuales se inspiraron los creadores de OWL para crear el lenguaje. Junto al entorno RDF y otros componentes, estas herramientas hacen posible el proyecto de web sem&aacute;ntica.</p><p>See Also <a class="glossseealso" href="#ontolog%C3%ADa inform%C3%A1tica">ONTOLOG&Iacute;A INFORM&Aacute;TICA</a>, <a class="glossseealso" href="#RDFS">RDF SCHEMA</a>, <a class="glossseealso" href="#RDF">RESOURCE DESCRIPTION FRAMEWORK</a>.</p></dd><dt><a name="SW"></a>WEB SEM&Aacute;NTICA</dt><dd><p>la Web sem&aacute;ntica (del ingl&eacute;s semantic web) es un conjunto de actividades desarrolladas en el seno de World Wide Web Consortium tendente a la creaci&oacute;n de tecnolog&iacute;as para publicar datos legibles por aplicaciones inform&aacute;ticas (m&aacute;quinas en la terminolog&iacute;a de la Web sem&aacute;ntica). Se basa en la idea de a&ntilde;adir metadatos sem&aacute;nticos y ontol&oacute;gicos a la World Wide Web. Esas informaciones adicionales &#8212;que describen el contenido, el significado y la relaci&oacute;n de los datos&#8212; se deben proporcionar de manera formal, para que as&iacute; sea posible evaluarlas autom&aacute;ticamente por m&aacute;quinas de procesamiento. El objetivo es mejorar Internet ampliando la interoperabilidad entre los sistemas inform&aacute;ticos usando "agentes inteligentes". Agentes inteligentes son programas en las computadoras que buscan informaci&oacute;n sin operadores humanos.</p><p>See Also <a class="glossseealso" href="#ontolog%C3%ADa inform%C3%A1tica">ONTOLOG&Iacute;A INFORM&Aacute;TICA</a>, <a class="glossseealso" href="#RDF">RESOURCE DESCRIPTION FRAMEWORK</a>.</p></dd><dt><a name="WWW"></a>WORLD WIDE WEB</dt><dd><p>en inform&aacute;tica, la World Wide Web (WWW) o Red inform&aacute;tica mundial es un sistema de distribuci&oacute;n de informaci&oacute;n basado en hipertexto o hipermedios enlazados y accesibles a trav&eacute;s de Internet. Con un navegador web, un usuario visualiza sitios web compuestos de p&aacute;ginas web que pueden contener texto, im&aacute;genes, v&iacute;deos u otros contenidos multimedia, y navega a trav&eacute;s de ellas usando hiperenlaces.</p><p>See Also <a class="glossseealso" href="#web server">SERVIDOR WEB</a>, <a class="glossseealso" href="#web site">SITIO WEB</a>.</p></dd><dt><a name="W3C"></a>WORLD WIDE WEB CONSORTIUM</dt><dd><p>el World Wide Web Consortium, abreviado W3C, es un consorcio internacional que produce recomendaciones para la World Wide Web.</p><p>See Also <a class="glossseealso" href="#WWW">WORLD WIDE WEB</a>.</p></dd></dl></div><div class="glossdiv"><h3 class="title">X</h3><dl><dt><a name="XML Schema"></a>XML SCHEMA</dt><dd><p>XML Schema es un lenguaje de esquema utilizado para describir la estructura y las restricciones de los contenidos de los documentos XML de una forma muy precisa, m&aacute;s all&aacute; de las normas sint&aacute;cticas impuestas por el propio lenguaje XML. Se consigue as&iacute; una percepci&oacute;n del tipo de documento con un nivel alto de abstracci&oacute;n. Fue desarrollado por el World Wide Web Consortium (W3C) y alcanz&oacute; el nivel de recomendaci&oacute;n en mayo de 2001.</p><p>See Also <a class="glossseealso" href="#XHTML">EXTENSIBLE HYPERTEXT MARKUP LANGUAGE</a>, <a class="glossseealso" href="#XML">EXTENSIBLE MARKUP LANGUAGE</a>, <a class="glossseealso" href="#SGML">STANDARD GENERALIZED MARKUP LANGUAGE</a>.</p></dd></dl></div></div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e227"></a>Chapter&nbsp;1.&nbsp;
		RESUMEN</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#d5e236">
			Palabras clave</a></span></dt></dl></div>
		
		<p>
		Este proyecto propone una interpretaci&oacute;n de los <em class="glossterm">mapas de conocimiento</em> 
		como una herramienta de apoyo para la <em class="glossterm">gesti&oacute;n del conocimiento</em>, 
		enfoc&aacute;ndose principalmente en los mapas que identifican y relacionan 
		recursos y procesos en una organizaci&oacute;n en la b&uacute;squeda de facilitar 
		la transferencia de conocimiento mediante la socializaci&oacute;n del mismo 
		entre ellas, mapas &eacute;stos sustentados en el primer modo de conversi&oacute;n 
		del modelo de creaci&oacute;n de conocimiento de Nonaka. Finalmente, se 
		presenta una propuesta de pasos para la construcci&oacute;n de un <em class="glossterm">S.I.</em> <em class="glossterm">web</em> 
		para modelar <a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a> usando <em class="glossterm">ontolog&iacute;as</em> para un contexto 
		organizacional.</p>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e236"></a>
			Palabras clave</h2></div></div></div>
			
			<p>
			<a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a>, <em class="glossterm">gesti&oacute;n del conocimiento</em>, <em class="glossterm">ontolog&iacute;a</em>, <a class="glossterm" href="#SI"><em class="glossterm">sistema de informaci&oacute;n</em></a>, dominio, contexto, organizaci&oacute;n, <em class="glossterm">web</em>, mapa, 
			conocimiento, gesti&oacute;n.</p>
		</div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e244"></a>Chapter&nbsp;2.&nbsp;
		INTRODUCCI&Oacute;N</h1></div></div></div>
		
		<p>
		El presente documento presenta la &#8220;IMPLEMENTACI&Oacute;N DE UN <a class="glossterm" href="#KMap"><em class="glossterm">MAPA DE CONOCIMIENTO</em></a> SOBRE PLATAFORMA <em class="glossterm">WEB</em> USANDO <em class="glossterm">ONTOLOG&Iacute;AS</em> PARA <a class="glossterm" href="#KM"><em class="glossterm">GESTI&Oacute;N DE CONOCIMIENTO</em></a> ORGANIZACIONAL&#8221; como proyecto para solventar las 
		carencias en <a class="glossterm" href="#KM"><em class="glossterm">Gesti&oacute;n de Conocimiento</em></a> que padecen las organizaciones 
		que pretenden encarar los retos de manejo de informaci&oacute;n que impone 
		el siglo XXI.</p>
		<p>
		Los <em class="glossterm">Mapas de Conocimiento</em> como herramienta para exposici&oacute;n de datos e 
		informaci&oacute;n procesada presentando conceptos y relaciones son 
		presentados y usados como la estructura fundamental en la que se 
		fundamenta la plataforma planteada para expresar conocimiento.</p>
		<p>
		Se conjugan dos (2) tecnolog&iacute;as &oacute;ptimas y de &uacute;ltima generaci&oacute;n para 
		el contexto del problema, con prestaciones y caracter&iacute;sticas claves 
		para el n&uacute;cleo del problema, as&iacute; como actuales y eficientes con 
		respecto a la evoluci&oacute;n acelerada y exponencial de las <em class="glossterm">TI</em>, como la 
		son: los <em class="glossterm">SI</em> implementados en plataformas con est&aacute;ndares <em class="glossterm">Web</em>, y las 
		<em class="glossterm">ontolog&iacute;as</em> y <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>.</p>
		<p>
		Se incluye un marco te&oacute;rico sobre el cual se sustenta el <em class="glossterm">SI</em> 
		planteado, los principios y tecnolog&iacute;as que lo soportan, la 
		arquitectura planteada, la pila de componentes y <em class="glossterm">frameworks</em> de 
		trabajo utilizados.</p>
		<p>
		Tambi&eacute;n se presentan las fases de desarrollo del proyecto que incluye 
		la fase de ejecuci&oacute;n donde se muestra el proceso de Ingenier&iacute;a del 
		Software y aplicaci&oacute;n de metodolog&iacute;as para la construcci&oacute;n del <em class="glossterm">SI</em> con 
		las caracter&iacute;sticas y requerimientos planteados.</p>
		<p>
		Al final se obtienen los resultados y conclusiones de todo el proceso 
		de desarrollo e implementaci&oacute;n del proyecto; incluyendo el <em class="glossterm">SI</em>, 
		manuales, documentaci&oacute;n, y dem&aacute;s paquetes que componen la entrega de 
		resultados.</p>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e267"></a>Chapter&nbsp;3.&nbsp;
		DEFINICI&Oacute;N DEL PROBLEMA</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#d5e269">
			ANTECEDENTES</a></span></dt><dt><span class="section"><a href="#d5e365">
			FORMULACI&Oacute;N</a></span></dt><dt><span class="section"><a href="#d5e371">
			DESCRIPCI&Oacute;N</a></span></dt></dl></div>
		
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e269"></a>
			ANTECEDENTES</h2></div></div></div>
			
			<p>
			Desde un punto de vista organizacional, una organizaci&oacute;n utiliza la 
			direcci&oacute;n estrat&eacute;gica para establecer su estrategia y planifica sus 
			acciones mediante la planificaci&oacute;n estrat&eacute;gica. De igual forma al 
			analizar las diferentes estructuras organizacionales se observan los 
			variados comportamientos que &eacute;stas generan, y la relaci&oacute;n entre la 
			direcci&oacute;n y planificaci&oacute;n estrat&eacute;gicas y la Ingenier&iacute;a del 
			Conocimiento.</p>
			<p>
			Se evidencia pues la importancia del conocimiento en la 
			organizaci&oacute;n. Al fin y al cabo, tal y como lo demuestran las 
			auditor&iacute;as internas y externas de las organizaciones, lo que hace 
			que una organizaci&oacute;n sea competitiva es su conjunto de recursos 
			intangibles, es decir, las capacidades &oacute; competencias (se utilizan 
			indistintamente estos dos t&eacute;rminos), y habilidades de sus recursos 
			(humanos o artificiales), y el conocimiento que &eacute;stas manejan para 
			desarrollarse de forma &oacute;ptima. De esta forma se introduce el 
			concepto de Capital en una organizaci&oacute;n; este puede ser de car&aacute;cter 
			Humano en la forma de Capital Humano, artificial en la forma de 
			Capital Estructural y Recursos Tangibles y organizacional en la 
			forma de Capital Organizacional representado por las interrelaciones 
			entre organizaciones involucradas en la ejecuci&oacute;n de procesos.</p>
			<p>
			Dicho de otro modo, la ventaja competitiva de la organizaci&oacute;n es 
			mayor en cuanto sus capacidades son realmente distintivas y 
			dif&iacute;cilmente imitables. De aqu&iacute;, la importancia de la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> en la organizaci&oacute;n, pero primeramente se aclara dicho 
			concepto.</p>
			<p>
			Seg&uacute;n (Davenport y Prusak, 1998) la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> 
			es:</p>
			<p>
			&#8220;El proceso sist&eacute;mico de buscar, organizar, filtrar y presentar la 
			informaci&oacute;n con el objetivo de mejorar la comprensi&oacute;n de las 
			personas en una &aacute;rea espec&iacute;fica de inter&eacute;s.&#8221;</p>
			<p></p>
			<p>
			Seg&uacute;n (Malhotra, 2001):</p>
			<p>
			&#8220;El proceso organizacional que busca la combinaci&oacute;n sin&eacute;rgica del 
			tratamiento de los datos y la informaci&oacute;n mediante las capacidades 
			de las <em class="glossterm">Tecnolog&iacute;as de la Informaci&oacute;n y las Comunicaciones (TIC)</em> y 
			las capacidades de creatividad e innovaci&oacute;n de las personas.&#8221;</p>
			<p></p>
			<p>
			Y seg&uacute;n (Sveiby, 2000):</p>
			<p>
			&#8220;El arte de crear valor con los activos intangibles de una 
			organizaci&oacute;n.&#8221;</p>
			<p></p>
			<p>
			Se observa en estas definiciones los diferentes puntos de vista o 
			focos de inter&eacute;s que se plantean en la <em class="glossterm">Gesti&oacute;n del Conocimiento</em>. 
			Para Davenport es el proceso de gestionar el conocimiento 
			(informaci&oacute;n que permite alcanzar un objetivo) que le da a la 
			organizaci&oacute;n una mayor comprensi&oacute;n de su entorno (interno o 
			externo); para Malhotra es el proceso tecnol&oacute;gico que aumenta la 
			creatividad e innovaci&oacute;n (fuentes de ventaja competitiva) en la 
			organizaci&oacute;n; y para Sveiby simplemente es el valor del conocimiento 
			(los activos intangibles) en la organizaci&oacute;n.</p>
			<p>
			De entre las diversas definiciones de <em class="glossterm">Gesti&oacute;n del Conocimiento</em>, y 
			desde el enfoque de inter&eacute;s aqu&iacute;, que es el de la Ingenier&iacute;a del 
			Conocimiento, podemos partir de la definici&oacute;n de (Carri&oacute;n, 
			2004):</p>
			<p>
			&#8220;El conjunto de procesos y sistemas que permiten que el Capital 
			Intelectual de una organizaci&oacute;n aumente de forma significativa, 
			mediante la gesti&oacute;n de sus capacidades de resoluci&oacute;n de problemas de 
			forma eficiente (en el menor espacio de tiempo posible), con el 
			objetivo final de generar ventajas competitivas sostenibles en el 
			tiempo.&#8221;</p>
			<p></p>
			<p>
			Pero con la siguiente modificaci&oacute;n:</p>
			<p>
			&#8220;La <em class="glossterm">Gesti&oacute;n (Tecnol&oacute;gica) del Conocimiento</em> es el conjunto de 
			procesos y sistemas (computacionales) que permiten a una 
			organizaci&oacute;n generar ventaja competitiva sostenible en el tiempo, 
			mediante la gesti&oacute;n eficiente de su conocimiento&#8221;.</p>
			<p>
				Los diferentes objetivos que desea alcanzar la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> son los siguientes:
				</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
						<p>
						Seleccionar y formular una estrategia de tipo organizacional que 
						permita una adecuada <em class="glossterm">Gesti&oacute;n del Conocimiento</em>.</p>
					</li><li class="listitem">
						<p>
						Implantar estrategias orientadas al conocimiento.</p>
					</li><li class="listitem">
						<p>
						Promover la mejora continua de los procesos de negocio, 
						principalmente en aquellos que permiten la generaci&oacute;n y 
						utilizaci&oacute;n del conocimiento.</p>
					</li><li class="listitem">
						<p>
						Monitorizar y evaluar los beneficios de la <em class="glossterm">Gesti&oacute;n del Conocimiento</em>.</p>
					</li><li class="listitem">
						<p>
						Reducir los tiempos y costes relacionados con la mejora continua 
						(productos y procesos).</p>
					</li></ul></div><p>
			</p>
			<p>
				Seg&uacute;n Suresh, la necesidad de aplicar la <a class="glossterm" href="#KM"><em class="glossterm">Gesti&oacute;n de Conocimiento</em></a> en 
				las organizaciones es la consecuencia de:
				</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
						<p>
						Una econom&iacute;a y unos requerimientos del mercado orientados a la 
						demanda de los clientes y la competencia internacional.</p>
					</li><li class="listitem">
						<p>
						Aumento de la demanda de los clientes de productos que responden 
						de forma m&aacute;s precisa sus necesidades y con una ventaja 
						mayor.</p>
					</li><li class="listitem">
						<p>
						P&eacute;rdida del conocimiento en la organizaci&oacute;n debido a un aumento 
						del volumen de ventas del personal.</p>
					</li><li class="listitem">
						<p>
						Permite a la organizaci&oacute;n reutilizar acciones de proyectos 
						anteriores llevados a cabo con &eacute;xito.</p>
					</li><li class="listitem">
						<p>
						Ayuda a la organizaci&oacute;n a no repetir errores, y por lo tanto, a 
						reducir el tiempo de respuesta.</p>
					</li></ul></div><p>
			</p>
			<p>
			De estas definiciones podemos concluir que el conocimiento es 
			&#8220;nuestra capacidad de entender (y por lo tanto utilizar para 
			nuestros objetivos) las cualidades y relaciones de las cosas que 
			componen nuestro entorno&#8221;.</p>
			<p>
				Una forma de entender el conocimiento es analizando sus diferencias 
				respecto a dato e informaci&oacute;n.
				</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
						<p>
						Un dato es un valor discreto que describe un hecho del mundo. Un 
						dato no est&aacute; estructurado, no dice nada sobre el porqu&eacute; de las 
						cosas, ni tampoco sobre su posible interpretaci&oacute;n o prop&oacute;sito 
						(por ejemplo, el valor 37).</p>
					</li><li class="listitem">
						<p>
						A diferencia de los datos, la informaci&oacute;n s&iacute; tiene interpretaci&oacute;n 
						y prop&oacute;sito (ya que intervienen el emisor y el receptor en el 
						mensaje), es decir, est&aacute;n representados en un contexto, siendo el 
						conjunto de datos estructurados que sirven para por ejemplo, 
						categorizar, analizar, evaluar, etc., los hechos del mundo que 
						nos rodean (por ejemplo, el valor 37 puede estar representando la 
						temperatura de un paciente).</p>
					</li><li class="listitem">
						<p>
						Finalmente, el conocimiento es mucho m&aacute;s amplio que la 
						informaci&oacute;n, y trata a &eacute;sta como instrumento para poder actuar, 
						es decir, es aquella informaci&oacute;n (adquirida, seleccionada, 
						evaluada, interiorizada, etc.) que nos permite llevar a cabo las 
						acciones para alcanzar nuestros objetivos. Visto de otra manera, 
						el conocimiento es aquella informaci&oacute;n que ha pasado por un 
						an&aacute;lisis, mediante el cual, dicha informaci&oacute;n adquiere una 
						relevancia y utilidad para poder actuar y alcanzar nuestros 
						objetivos (por ejemplo, el valor 37 de temperatura puede 
						relacionarse con la categor&iacute;a &#8220;fiebre infecciosa&#8221;, y dicha 
						categor&iacute;a con la acci&oacute;n &#8220;medicar antibi&oacute;tico&#8221; para alcanzar el 
						objetivo &#8220;curado&#8221;).</p>
					</li></ul></div><p>
			</p>
			<p>
			Podemos representar dichas diferencias entre dato, informaci&oacute;n y 
			conocimiento en la Figura 1. En ella observamos las distintas fases 
			por las que pasan los datos, transform&aacute;ndose en informaci&oacute;n 
			(mediante la contextualizaci&oacute;n), y finalmente en conocimiento 
			(mediante el an&aacute;lisis).</p>
			<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura01.jpg" align="middle" width="450"></td></tr></table><div class="caption">
					<p>
					Figura 1. La transformaci&oacute;n de datos a informaci&oacute;n y a 
					conocimiento.</p>
				</div></div>
			<p>
			Otra forma de entender el conocimiento es mediante el valor a&ntilde;adido 
			que se va agregando mediante los procesos en torno a la Cadena de 
			Transformaci&oacute;n de la Informaci&oacute;n (ver Figura 2.).</p>
			<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura02.jpg" align="middle" width="450"></td></tr></table><div class="caption">
					<p>
					Figura 2. La cadena de transformaci&oacute;n de la Informaci&oacute;n.</p>
				</div></div>
			<p>
				Para las organizaciones, el conocimiento se puede definir como la 
				informaci&oacute;n que posee valor para ella, es decir, aquella 
				informaci&oacute;n que le permite generar una ventaja competitiva, 
				satisfacer las demandas del mercado o alcanzar las oportunidades a 
				trav&eacute;s de la utilizaci&oacute;n de las competencias distintivas de la 
				organizaci&oacute;n. Las diferentes categor&iacute;as de conocimiento para las 
				organizaciones son:
				</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
						<p>
						T&aacute;cito/Expl&iacute;cito: Lo analizaremos en el siguiente apartado, seg&uacute;n 
						la accesibilidad del conocimiento.</p>
					</li><li class="listitem">
						<p>
						Observable/No Observable: Es el conocimiento que se ve reflejado 
						en los productos o servicios que ofrece la organizaci&oacute;n.</p>
					</li><li class="listitem">
						<p>
						Positivo/Negativo: Es el conocimiento generado por el &aacute;rea de I+D 
						en los procesos Desarrollo de Nuevos Productos o Innovaci&oacute;n de 
						los Procesos (seg&uacute;n el MGIT) particionado en los descubrimientos 
						(positivo) y las aproximaciones no &uacute;tiles (negativo).</p>
					</li><li class="listitem">
						<p>
						Aut&oacute;nomo/Sist&eacute;mico: Es el conocimiento que genera valor sin la 
						necesidad de aplicar sensibles modificaciones en la configuraci&oacute;n 
						de la organizaci&oacute;n (aut&oacute;nomo) o el que depende del valor generado 
						por otros componentes de la configuraci&oacute;n de la organizaci&oacute;n 
						(sist&eacute;mico).</p>
					</li></ul></div><p>
			</p>
			<p>
			R&eacute;gimen de Propiedad Intelectual: Es el conocimiento protegido por 
			la Ley de Propiedad Intelectual.</p>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e365"></a>
			FORMULACI&Oacute;N</h2></div></div></div>
			
			<p>
			Dados los nuevos retos que encaran las t&eacute;cnicas de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> tradicionales y el gran flujo de informaci&oacute;n que 
			manejan las organizaciones y empresas del siglo XXI, &iquest;c&oacute;mo 
			herramientas como los <em class="glossterm">Mapas de Conocimiento</em> pueden soportar la 
			<em class="glossterm">Gesti&oacute;n del Conocimiento</em>, y estructurar la informaci&oacute;n existente 
			para convertirla en conocimiento, de modo que los actores de la 
			organizaci&oacute;n y la organizaci&oacute;n en s&iacute; misma puedan hacer uso &uacute;til de 
			los activos y recursos existentes y necesarios?</p>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e371"></a>
			DESCRIPCI&Oacute;N</h2></div></div></div>
			
			<p>
			Las organizaciones del siglo XXI est&aacute;n sujetas a las <em class="glossterm">TI</em> para cumplir 
			sus objetivos, y alcanzar su visi&oacute;n y misi&oacute;n, sin embargo la sola 
			informaci&oacute;n no es suficiente, menos hablar de los meros datos, de 
			modo que se empieza a tangibilizar la necesidad de conocimiento &uacute;til 
			que sea m&aacute;s sugerente y persuasivo para los actores que desempe&ntilde;an 
			las funciones organizacionales.</p>
			<p>
			La jerarqu&iacute;a organizacional vista en su modelo de pir&aacute;mide de tres 
			niveles (Marulanda, 2009) est&aacute; compuesta en la base por un nivel 
			Operativo, en el medio por un nivel T&aacute;ctico y en la c&uacute;spide por un 
			nivel Gerencial; sin embargo las soluciones <em class="glossterm">TI</em> tradicionales 
			solucionan problemas pr&aacute;cticos mayormente del nivel b&aacute;sico 
			Operativo, mientras que el conocimiento hol&iacute;stico que rigen la 
			filosof&iacute;a y tendencias organizacionales con miras a cumplir los 
			objetivos organizacionales y la visi&oacute;n y misi&oacute;n, y del cual se deben 
			retroalimentar los actores del nivel Gerencial y T&aacute;ctico para tomar 
			decisiones y avanzar en direcci&oacute;n a las metas organizacionales no es 
			gestionado, ni tratado, ni procesado por los <em class="glossterm">SI</em> t&iacute;picos de una 
			organizaci&oacute;n. Esta perspectiva hol&iacute;stica del conocimiento intangible 
			de una organizaci&oacute;n en el mejor de los casos es gestionado por 
			software robusto y anticuado que no corresponde con los avances 
			tecnol&oacute;gicos actuales y que no presenta los recursos como 
			conocimiento din&aacute;mico y con interrelaciones, sino como simples 
			activos organizacionales.</p>
			<p>
			El modelo de &#8220;La Cadena de Transformaci&oacute;n de la Informaci&oacute;n&#8221; 
			(Paniagua, 2007) ha sido usado como un bosquejo que muestra los 
			pasos a seguir para resolver la carencia existente de conocimiento 
			plausible en la <em class="glossterm">Gesti&oacute;n Tecnol&oacute;gica</em>; sin embargo por su propia 
			naturaleza de esquema conceptual no presenta soluciones 
			implementables para llevar a cabo los procesos requeridos para 
			obtener el resultado que pretende el modelo.</p>
			<p>
			Adicionalmente, las <em class="glossterm">TI</em> evolucionan exponencialmente, y la <em class="glossterm">web</em> sigue 
			su crecimiento acelerado en tecnolog&iacute;as avanzadas que incrementan el 
			caudal y complejidad del flujo de informaci&oacute;n a procesar, y debido a 
			esto una soluci&oacute;n que pretenda abordar el problema del conocimiento 
			en la <em class="glossterm">gesti&oacute;n tecnol&oacute;gica</em> deber&aacute; corresponder con estos avances 
			t&eacute;cnicos que presenta la inform&aacute;tica actual y futura.</p>
			<p>
			La <em class="glossterm">Gesti&oacute;n del Conocimiento</em> (<em class="glossterm">KM</em>) como rama de las Ciencias de la 
			Computaci&oacute;n pretende presentar soluciones a las demandas de 
			Conocimiento organizacionales, por lo cual se hace el nicho adecuado 
			para enmarcar una soluci&oacute;n alternativa a este problema. Por otro 
			lado, la <em class="glossterm">web</em> como est&aacute;ndar y como tecnolog&iacute;a actual se muestra como 
			el camino a seguir; con la adici&oacute;n de usar un enfoque particular 
			para este fin, una herramienta nueva que se acopla a los 
			requerimientos del problema de la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> (<em class="glossterm">KM</em>) como 
			lo es la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a> y en particular las <em class="glossterm">Ontolog&iacute;as</em>.</p>
		</div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e392"></a>Chapter&nbsp;4.&nbsp;
		JUSTIFICACI&Oacute;N</h1></div></div></div>
		
		<p>
		Sin importar de qu&eacute; naturaleza sea la organizaci&oacute;n, instituci&oacute;n o 
		entidad, cualquiera deber&aacute; gestionar su conocimiento con las t&eacute;cnicas 
		que le permiten sobrevivir y ser competitiva en el mundo, i.e. por 
		medio de las <em class="glossterm">T.I.</em>; sin embargo actualmente el simple uso de <em class="glossterm">T.I.</em> no 
		es suficiente para la supervivencia de una organizaci&oacute;n, no s&oacute;lo 
		desde el punto de vista competitivo en el nicho agreste en el que se 
		desenvuelven las organizaciones, sino desde el punto de vista de 
		<em class="glossterm">gesti&oacute;n del conocimiento</em> en el &aacute;mbito interno; un nuevo enfoque de la 
		<em class="glossterm">Gesti&oacute;n del Conocimiento</em> debe ser abordado, de modo que las 
		organizaciones sean m&aacute;s productivas, valoren m&aacute;s sus activos 
		intelectuales y puedan sobrevivir al caos de informaci&oacute;n que 
		presupone estar posicionada en un sector espec&iacute;fico del mundo 
		real.</p>
		<p>
		Se trata de que la <em class="glossterm">Gesti&oacute;n del Conocimiento</em>, esa disciplina 
		fundamental aplicada por toda organizaci&oacute;n, ahora realmente se 
		tratar&aacute; de gestionar conocimiento, desde el punto de vista cognitivo 
		y &uacute;til, tanto por y para humanos, como por y para m&aacute;quinas. Las <em class="glossterm">T.I.</em> 
		son indispensables en la <em class="glossterm">Gesti&oacute;n del Conocimiento</em>, ahora ser&aacute; 
		indispensable una gesti&oacute;n realmente cognitiva, donde tanto m&aacute;quinas 
		como humanos puedan hacer uso &aacute;gil y &uacute;til del conocimiento.</p>
		<p>
		Las herramientas y <em class="glossterm">S.I.'s</em> que <em class="glossterm">Gestionen Conocimiento</em> son un paso 
		necesario para el futuro de las organizaciones; el aporte al 
		entendimiento de este paradigma con las tecnolog&iacute;as subyacentes que 
		lo constituyen es objeto del presente trabajo. Los <em class="glossterm">S.I.</em> orientados a 
		la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> son una nueva clase de <em class="glossterm">S.I.'s</em> que 
		ser&aacute;n el est&aacute;ndar en el futuro pr&oacute;ximo de las organizaciones, estos 
		<em class="glossterm">S.I.'s</em> ayudar&aacute;n a hacer de las organizaciones un lugar m&aacute;s &uacute;til 
		como base de conocimientos y del mismo modo, habr&aacute; beneficios de 
		estas tendencias, obteniendo mejores resultados en cuanto a 
		valoraci&oacute;n de sus activos y optimizaci&oacute;n de procesos internos. Con 
		las herramientas de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> como lo son los <em class="glossterm">Mapas de Conocimiento</em> las organizaciones sabr&aacute;n administrar el caos de 
		informaci&oacute;n en el que se encuentran sumergidas, para emerger en un 
		mundo donde la informaci&oacute;n es usada de manera sabia. Es en el 
		presente trabajo que compete aportar los conocimientos b&aacute;sicos para 
		incursionar en el mundo de las herramientas de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> mediante la implementaci&oacute;n de un <a class="glossterm" href="#KMap"><em class="glossterm">Mapa de Conocimiento</em></a> 
		sobre <em class="glossterm">S.I.</em> <em class="glossterm">Web</em>, de este modo se apreciar&aacute;n las implicaciones que 
		tiene usar estas herramientas en el mundo real.</p>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e416"></a>Chapter&nbsp;5.&nbsp;
		OBJETIVOS</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#d5e418">
			OBJETIVO GENERAL</a></span></dt><dt><span class="section"><a href="#d5e423">
			OBJETIVOS ESPEC&Iacute;FICOS</a></span></dt></dl></div>
		
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e418"></a>
			OBJETIVO GENERAL</h2></div></div></div>
			
			<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
					<p>
					IMPLEMENTAR UN MAPA DE CONOCIMIENTO SOBRE PLATAFORMA WEB USANDO 
					ONTOLOG&Iacute;AS PARA GESTI&Oacute;N DE CONOCIMIENTO ORGANIZACIONAL.</p>
				</li></ul></div>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e423"></a>
			OBJETIVOS ESPEC&Iacute;FICOS</h2></div></div></div>
			
			<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
					<p>
					Asimilar los activos concernientes mediante la catalogaci&oacute;n de 
					estos recursos para saber sobre qu&eacute; material se va a 
					modelar.</p>
				</li><li class="listitem">
					<p>
					Aplicar t&eacute;cnicas de modelamiento a los recursos y el dominio como 
					jerarqu&iacute;as de clases, relaciones y diagramas UML para obtener el 
					<em class="glossterm">modelo de conocimiento</em> del dominio.</p>
				</li><li class="listitem">
					<p>
					Definir las <em class="glossterm">ontolog&iacute;as</em> que modelan los conceptos del dominio 
					mediante varios lenguajes para adecuar los recursos a un <em class="glossterm">modelo de conocimiento</em>.</p>
				</li><li class="listitem">
					<p>
					Cotejar las <em class="glossterm">ontolog&iacute;as</em> obtenidas observando el nivel de 
					acoplamiento con el <em class="glossterm">modelo de conocimiento</em> para entender las 
					diferencias entre &eacute;stas y tener un buen criterio para escoger el 
					lenguaje que m&aacute;s conviene a la implementaci&oacute;n del <em class="glossterm">S.I.</em></p>
				</li><li class="listitem">
					<p>
					Elaborar el <a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a> mediante metodolog&iacute;as t&iacute;picas 
					para implementar el mismo al <em class="glossterm">S.I.</em></p>
				</li><li class="listitem">
					<p>
					Indagar que herramientas y arquitectura soportan un <em class="glossterm">S.I.</em> orientado 
					a <em class="glossterm">Gesti&oacute;n del Conocimiento</em> buscando y consultando m&uacute;ltiples 
					fuentes para establecer los detalles t&eacute;cnicos de la plataforma de 
					implementaci&oacute;n.</p>
				</li><li class="listitem">
					<p>
					Dise&ntilde;ar las plantillas y p&aacute;ginas interfaz usando t&eacute;cnicas de 
					dise&ntilde;o <em class="glossterm">web</em> para obtener la interfaz del <em class="glossterm">S.I.</em> que presentar&aacute; las 
					funcionalidades de <em class="glossterm">gesti&oacute;n del conocimiento</em> y de <a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a> al usuario.</p>
				</li><li class="listitem">
					<p>
					Formular <em class="glossterm">servicios web</em> usando est&aacute;ndares y recomendaciones W3C 
					para ofrecer funcionalidades y servicios &uacute;tiles para la 
					distribuci&oacute;n y acoplamiento de informaci&oacute;n en el entorno cognitivo 
					que se plantea.</p>
				</li></ul></div>
		</div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e457"></a>Chapter&nbsp;6.&nbsp;
		MARCO TE&Oacute;RICO</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#d5e459">
			MARCO CONCEPTUAL</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e461">
				GESTI&Oacute;N DEL CONOCIMIENTO (KM), MAPAS DE CONOCIMIENTO (KMap) Y 
				ONTOLOG&Iacute;AS</a></span></dt><dt><span class="section"><a href="#d5e518">
				EST&Aacute;NDARES, WEB Y LENGUAJES DE MARCAS</a></span></dt><dt><span class="section"><a href="#d5e802">
				RESOURCE DESCRIPTION FRAMEWORK (RDF), ONTOLOG&Iacute;AS Y WEB 
				SEM&Aacute;NTICA</a></span></dt><dt><span class="section"><a href="#d5e993">
				FRAMEWORKS Y Yii FRAMEWORK</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1024">
			ENTORNO Y STACK DE COMPONENTES (XAMPP)</a></span></dt></dl></div>
		
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e459"></a>
			MARCO CONCEPTUAL</h2></div></div></div>
			
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e461"></a>
				GESTI&Oacute;N DEL CONOCIMIENTO (KM), MAPAS DE CONOCIMIENTO (KMap) Y 
				ONTOLOG&Iacute;AS</h3></div></div></div>
				
				<p>
				El Conocimiento es Poder. Hay una m&aacute;xima que ha estado, est&aacute; y 
				seguir&aacute; estando vigente: &#8220;La organizaci&oacute;n que tiene la mejor 
				informaci&oacute;n, sabe d&oacute;nde encontrarla, y puede utilizarla m&aacute;s r&aacute;pido 
				gana.&#8221;. Es un saber com&uacute;n que la organizaci&oacute;n con la mayor 
				informaci&oacute;n gana (Daconta et al., 2003). Al dar un vistazo amplio a 
				la definici&oacute;n de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> se ve que &#8220;es un concepto 
				aplicado en las organizaciones, que busca transferir el 
				conocimiento y la experiencia existente entre sus miembros, de modo 
				que pueda ser utilizado como un recurso disponible para otros en la 
				organizaci&oacute;n. Usualmente el proceso implica t&eacute;cnicas para capturar, 
				organizar, almacenar el conocimiento de los trabajadores, para 
				transformarlo en un activo intelectual que preste beneficios y se 
				pueda compartir. En la actualidad, las tecnolog&iacute;as de informaci&oacute;n 
				permiten contar con herramientas que apoyan la <em class="glossterm">gesti&oacute;n del conocimiento</em> en las empresas, apoyando en la recolecci&oacute;n, la 
				transferencia, la seguridad y la administraci&oacute;n sistem&aacute;tica de la 
				informaci&oacute;n, junto con los sistemas dise&ntilde;ados para ayudar a hacer 
				el mejor uso de ese conocimiento. En detalle, se refiere a las 
				herramientas y a las t&eacute;cnicas dise&ntilde;adas para preservar la 
				disponibilidad de la informaci&oacute;n llevada a cabo por los individuos 
				dominantes y facilitar la toma de decisiones, as&iacute; como reducir el 
				riesgo.&#8221; (&#8220;Gesti&oacute;n del conocimiento&#8221;, 2012); la <em class="glossterm">KM</em> (por sus siglas 
				en ingl&eacute;s, <em class="glossterm">Knowledge Management</em>) comprende un rango de estrategias 
				y pr&aacute;cticas usadas en una organizaci&oacute;n para identificar, crear, 
				representar, distribuir y habilitar la adopci&oacute;n de comprensi&oacute;n y 
				experiencias. Esta comprensi&oacute;n y experiencias comprenden 
				conocimiento, ya sea encarnado en individuos o embebido en procesos 
				o pr&aacute;cticas organizacionales. Los esfuerzos de <em class="glossterm">KM</em> t&iacute;picamente se 
				concentran en objetivos organizacionales como desempe&ntilde;o mejorado, 
				ventaja competitiva, innovaci&oacute;n, compartir lecciones aprendidas, 
				integraci&oacute;n y mejoramiento continuo de la organizaci&oacute;n (&#8220;Knowledge 
				management&#8221;, 2012), la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> es una disciplina 
				que comprende las herramientas, t&eacute;cnicas y procesos para el manejo 
				m&aacute;s efectivo y eficiente de los activos intelectuales de una 
				organizaci&oacute;n (Davies et al., 2003).</p>
				<p>
				Es sentido com&uacute;n. &iquest;Qui&eacute;n no quiere el mejor conocimiento? &iquest;Qui&eacute;n no 
				quiere buena informaci&oacute;n? Sin embargo las t&eacute;cnicas tradicionales de 
				<em class="glossterm">Gesti&oacute;n del Conocimiento</em> han encarado nuevos retos debidos al 
				Internet de hoy: sobrecarga de informaci&oacute;n, la ineficiencia de la 
				b&uacute;squeda por palabra clave, la falta de informaci&oacute;n fehaciente 
				(confiable), y la falta de sistemas computacionales para 
				procesamiento del lenguaje natural. La <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a> [y las 
				<em class="glossterm">Ontolog&iacute;as</em>] puede[n] brindar estructura al caos de informaci&oacute;n 
				(Daconta et al., 2003).</p>
				<p>
				Los sistemas de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> tienen un nicho espec&iacute;fico 
				d&oacute;nde son necesarios como herramienta definitivas para el desempe&ntilde;o 
				de operaciones vitales; especialmente en la gesti&oacute;n estrat&eacute;gica 
				organizacional, campos como la representaci&oacute;n del conocimiento, la 
				gesti&oacute;n e intercambio descentralizado de conocimiento e informaci&oacute;n 
				son algunos en los cuales los sistemas de <em class="glossterm">Gesti&oacute;n del Conocimiento</em> 
				tienen su soporte m&aacute;s importante; son sin embargo los <em class="glossterm">Mapas de Conocimiento</em> una de las herramientas fundamentales sobre las que se 
				enfoca el presente trabajo.</p>
				<p>
				En el marco de la <em class="glossterm">gesti&oacute;n del conocimiento</em> existen actualmente una 
				gran cantidad de estrategias organizacionales, t&eacute;cnicas y 
				herramientas, algunas apoyadas en <em class="glossterm">T.I.</em>, que son utilizadas para su 
				implementaci&oacute;n, de acuerdo con el contexto sobre el cual se 
				desempe&ntilde;a la organizaci&oacute;n, pero muchas de estas estrategias y 
				herramientas no son utilizadas solo en la <em class="glossterm">gesti&oacute;n del conocimiento</em> 
				y no todas surgieron en respuesta a ella. Sin embargo, una de las 
				herramientas que surge en respuesta a la <em class="glossterm">gesti&oacute;n del conocimiento</em>, 
				son los <em class="glossterm">mapas de conocimiento</em>.</p>
				<p>
				Es por esto que los <em class="glossterm">mapas de conocimiento</em> son una herramienta de 
				apoyo para la <em class="glossterm">gesti&oacute;n del conocimiento</em>, herramienta que apoya la 
				identificaci&oacute;n de recursos y procesos para facilitar la interacci&oacute;n 
				y socializaci&oacute;n de conocimiento entre los actores de la 
				organizaci&oacute;n.</p>
				<p>
				A diferencia de los t&eacute;rminos &#8220;conocimiento&#8221; y &#8220;<em class="glossterm">gesti&oacute;n del conocimiento</em>&#8221;, parece haber un consenso en la literatura sobre el 
				concepto de &#8220;<a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a>&#8221;. Al revisar el t&eacute;rmino, se 
				evidencian algunas variaciones, pero en esencia apuntan a lo 
				mismo.</p>
				<p>
				De acuerdo con P&Eacute;REZ, D. &amp; DRESSLER, M. (2007), los <em class="glossterm">mapas de conocimiento</em> son &#8220;directorios que facilitan la localizaci&oacute;n del 
				conocimiento dentro de la organizaci&oacute;n mediante el desarrollo de 
				gu&iacute;as y listados de personas, o documentos, por &aacute;reas de actividad 
				o materias de dominio&#8221;, que con apoyo de la tecnolog&iacute;a son 
				publicados como directorios o gr&aacute;ficos que muestran en d&oacute;nde se 
				encuentra el conocimiento (DAVENPORT, T. &amp; PRUSAK, L.; 
				1998).</p>
				<p>
				Como complemento a lo anterior, se conciben como representaciones 
				visuales del conocimiento y se convierten en un sitio para 
				encontrar respuestas de una manera m&aacute;s r&aacute;pida en la organizaci&oacute;n 
				(UNIVERSIDAD EAFIT; S.F.)</p>
				<p>
				Sin embargo, se debe hacer un llamado de atenci&oacute;n a que un <a class="glossterm" href="#KMap"><em class="glossterm">mapa de conocimiento</em></a> en un nivel m&aacute;s estricto, debe surgir generalmente de 
				una auditor&iacute;a de conocimiento, en la cual se identifica la 
				informaci&oacute;n y conocimiento central que se necesita y que se usa en 
				una organizaci&oacute;n, adem&aacute;s de brechas, duplicidad y flujos de 
				informaci&oacute;n y conocimiento y c&oacute;mo contribuyen al logro de las metas 
				organizacionales (DALKIR, K.; 2005). Desde esta perspectiva, los 
				<em class="glossterm">mapas de conocimiento</em> permiten identificar y representar tanto los 
				conocimientos disponibles en la organizaci&oacute;n como aquellos que se 
				consideran necesarios para su operaci&oacute;n (RIVERO, S.; S.F.).</p>
				<p>
				Adicionalmente, en el contexto de la Ingenier&iacute;a de Sistemas y de 
				las Ciencias de la Computaci&oacute;n, el concepto de Dominio entendido 
				como alg&uacute;n &aacute;mbito del mundo acerca del cual deseamos expresar alg&uacute;n 
				conocimiento es fundamental, y lo es con m&aacute;s relevancia en el 
				&aacute;mbito de la Ingenier&iacute;a Ontol&oacute;gica, entendida &eacute;sta como la creaci&oacute;n 
				de representaciones y la representaci&oacute;n de conceptos abstractos y 
				generales usados a su vez para representar conceptos de dominios 
				complejos (Russel y Norvig, 2004).</p>
				<p>
				La Ingenier&iacute;a Ontol&oacute;gica vista como una, entre otras, de las 
				t&eacute;cnicas de representaci&oacute;n del conocimiento (&#8220;Representaci&oacute;n del 
				conocimiento&#8221;, 2009), &eacute;sta &uacute;ltima una de las &aacute;reas m&aacute;s 
				representativas de la Inteligencia Artificial, basa su discurso en 
				el concepto de <a class="glossterm" href="#ontolog%C3%ADa"><em class="glossterm">Ontolog&iacute;a</em></a>. El t&eacute;rmino <a class="glossterm" href="#ontolog%C3%ADa"><em class="glossterm">Ontolog&iacute;a</em></a> tiene sus ra&iacute;ces en 
				la filosof&iacute;a griega: &#8220;En filosof&iacute;a, la <a class="glossterm" href="#ontolog%C3%ADa"><em class="glossterm">ontolog&iacute;a</em></a> (del griego &#959;&#957;&#964;&#959;&#962;, 
				genitivo del participio del verbo &#949;&#7984;&#956;&#943;, ser, estar; y &#955;&oacute;&#947;&#959;&#962;, 
				ciencia, estudio, teor&iacute;a) es una parte de la metaf&iacute;sica que estudia 
				lo que hay,1 es decir cu&aacute;les entidades existen y cu&aacute;les no.&#8221; 
				(&#8220;Ontolog&iacute;a&#8221;, 2012); sin embargo en inform&aacute;tica tiene una acepci&oacute;n 
				m&aacute;s espec&iacute;fica, de modo que el t&eacute;rmino &#8220;hace referencia a la 
				formulaci&oacute;n de un exhaustivo y riguroso esquema conceptual dentro 
				de uno o varios dominios dados; con la finalidad de facilitar la 
				comunicaci&oacute;n y el intercambio de informaci&oacute;n entre diferentes 
				sistemas y entidades&#8221; (&#8220;Ontolog&iacute;a &#8211;inform&aacute;tica-&#8221;, 2012). Es decir 
				que se puede entender <a class="glossterm" href="#ontolog%C3%ADa"><em class="glossterm">ontolog&iacute;a</em></a> como una entidad o unidad que 
				organiza todo lo existente en el mundo en una jerarqu&iacute;a de 
				categor&iacute;as (Russel y Norvig, 2004), o como la unidad que define las 
				palabras y conceptos comunes (el significado) usados para describir 
				y representar un &aacute;rea del conocimiento (Daconta et al., 2003), o 
				como un producto de ingenier&iacute;a consistente de un vocabulario 
				espec&iacute;fico usado para describir [una parte de] la realidad, m&aacute;s un 
				conjunto expl&iacute;cito de asumpciones que tienen que ver con el 
				significado intencionado de ese vocabulario, en otras palabras, la 
				especificaci&oacute;n de una conceptualizaci&oacute;n (Daconta et al., 2003). Es, 
				sin embargo, en el &aacute;mbito espec&iacute;fico de la naciente <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a> 
				d&oacute;nde el concepto de <em class="glossterm">ontolog&iacute;a</em> juega un rol fundamental debido a 
				que entrelaza el entendimiento humano de s&iacute;mbolos con su 
				procesabilidad por m&aacute;quinas, facilita el compartimiento y re-uso de 
				conocimiento y sobretodo promete un entendimiento compartido y 
				com&uacute;n de un dominio que puede ser comunicado entre personas y 
				sistemas de aplicaciones (Davies et al., 2003).</p>
				<p>
				El t&eacute;rmino Sistema, &#8220;(del lat&iacute;n systema, proveniente del griego 
				&#963;&#973;&#963;&#964;&#951;&#956;&#945;)&#8221;, entendido como &#8220;un conjunto de funciones, virtualmente 
				referenciada sobre ejes, bien sean estos reales o abstractos&#8221; o 
				como &#8220;un conjunto de elementos din&aacute;micamente relacionados formando 
				una actividad para alcanzar un objetivo operando sobre datos, 
				energ&iacute;a y/o materia para proveer informaci&oacute;n&#8221; (&#8220;Sistema&#8221;, 2010) es 
				un concepto general y amplio que tiene varias categor&iacute;as y tipos 
				m&aacute;s espec&iacute;ficos como lo es el <a class="glossterm" href="#SI"><em class="glossterm">Sistema de Informaci&oacute;n</em></a> (<em class="glossterm">S.I.</em>). Un 
				<em class="glossterm">S.I.</em> se entiende como &#8220;un conjunto de datos organizados listos y 
				preparados para su posterior uso, generados por una necesidad. Todo 
				interact&uacute;a entre s&iacute; para procesar los datos y la informaci&oacute;n 
				(incluyendo procesos manuales y autom&aacute;ticos) y distribuirla de la 
				manera m&aacute;s posible en una determinada organizaci&oacute;n en funci&oacute;n de 
				sus objetivos.&#8221; y hay una especializaci&oacute;n de &eacute;ste como lo es el 
				<em class="glossterm">Sistema de Informaci&oacute;n Inform&aacute;tico</em> que es &#8220;el campo de estudio de 
				la Tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n, este tipo de 
				sistemas son: Un medio implementado tecnol&oacute;gicamente para grabar, 
				almacenar y distribuir expresiones ling&uuml;&iacute;sticas; as&iacute; como para 
				extraer conclusiones a partir de dichas expresiones.&#8221; (&#8220;Sistema de 
				informaci&oacute;n&#8221;, 2012). Sin embargo, en este trabajo se usar&aacute;n 
				indistintamente, como sin&oacute;nimos, los t&eacute;rminos <a class="glossterm" href="#SI"><em class="glossterm">Sistema de Informaci&oacute;n</em></a> (<em class="glossterm">S.I.</em>) y <em class="glossterm">Sistema de Informaci&oacute;n Inform&aacute;tico</em>, refiriendo 
				aquel <em class="glossterm">S.I.</em> con base tecnol&oacute;gica e inform&aacute;tica; objeto principal 
				&eacute;ste, del estudio de la Ingenier&iacute;a de Sistemas y las Ciencias de la 
				Computaci&oacute;n, as&iacute; como del presente trabajo.</p>
				<p>
				Son conceptos como <em class="glossterm">Gesti&oacute;n del Conocimiento</em>, <a class="glossterm" href="#ontolog%C3%ADa inform%C3%A1tica"><em class="glossterm">Ontolog&iacute;a</em></a>, <a class="glossterm" href="#SI"><em class="glossterm">Sistema de Informaci&oacute;n</em></a>, amparados en otros como Dominio, Ingenier&iacute;a 
				Ontol&oacute;gica, <em class="glossterm">Web</em>, Sem&aacute;ntica y Sistema, los que proporcionan el nicho 
				en el que se asienta el presente trabajo.</p>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e518"></a>
				EST&Aacute;NDARES, WEB Y LENGUAJES DE MARCAS</h3></div></div></div>
				
				<p>
				Es sabido que &#8220;La <em class="glossterm">Web</em> fue creada alrededor de 1989 por el ingl&eacute;s 
				Tim Berners-Lee y el belga Robert Cailliau mientras trabajaban en 
				el CERN en Ginebra, Suiza, y publicado en 1992. Desde entonces, 
				Berners-Lee ha jugado un papel activo guiando el desarrollo de 
				est&aacute;ndares <em class="glossterm">Web</em> (como los lenguajes de marcado con los que se crean 
				las <em class="glossterm">p&aacute;ginas web</em>), y en los &uacute;ltimos a&ntilde;os ha abogado por su visi&oacute;n de 
				una <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>.&#8221; (&#8220;World Wide Web&#8221;, 2012), e indagando m&aacute;s 
				profundamente en sus or&iacute;genes, se ve que &#8220;La idea subyacente de la 
				<em class="glossterm">Web</em> se remonta a la propuesta de Vannevar Bush en los a&ntilde;os 40 sobre 
				un sistema similar: a grandes rasgos, un entramado de informaci&oacute;n 
				distribuida con una interfaz operativa que permit&iacute;a el acceso tanto 
				a la misma como a otros art&iacute;culos relevantes determinados por 
				claves. Este proyecto nunca fue materializado, quedando relegado al 
				plano te&oacute;rico bajo el nombre de Memex. Es en los a&ntilde;os 50 cuando Ted 
				Nelson realiza la primera referencia a un sistema de hipertexto, 
				donde la informaci&oacute;n es enlazada de forma libre. Pero no es hasta 
				1980, con un soporte operativo tecnol&oacute;gico para la distribuci&oacute;n de 
				informaci&oacute;n en redes inform&aacute;ticas, cuando Tim Berners-Lee propone 
				ENQUIRE al CERN (refiri&eacute;ndose a Enquire Within Upon Everything, en 
				castellano Preguntando de Todo Sobre Todo), donde se materializa la 
				realizaci&oacute;n pr&aacute;ctica de este concepto de incipientes nociones de la 
				<em class="glossterm">Web</em>. En marzo de 1989, Tim Berners Lee, ya como personal de la 
				divis&oacute;n DD del CERN, redacta la propuesta,2 que referenciaba a 
				ENQUIRE y describ&iacute;a un sistema de gesti&oacute;n de informaci&oacute;n m&aacute;s 
				elaborado. No hubo un bautizo oficial o un acu&ntilde;amiento del t&eacute;rmino 
				<em class="glossterm">web</em> en esas referencias iniciales utiliz&aacute;ndose para tal efecto el 
				t&eacute;rmino mesh. Sin embargo, el <a class="glossterm" href="#WWW"><em class="glossterm">World Wide Web</em></a> ya hab&iacute;a nacido. Con 
				la ayuda de Robert Cailliau, se public&oacute; una propuesta m&aacute;s formal 
				para la <a class="glossterm" href="#WWW"><em class="glossterm">world wide web</em></a> el 12 de noviembre de 1990. [&#8230;] El gran 
				avance de Berners-Lee fue unir hipertexto e Internet. En su libro 
				Weaving the Web (en castellano, Tejiendo la Red), explica que &eacute;l 
				hab&iacute;a sugerido repetidamente que la uni&oacute;n entre las dos tecnolog&iacute;as 
				era posible para miembros de las dos comunidades tecnol&oacute;gicas, pero 
				como nadie acept&oacute; su invitaci&oacute;n, decidi&oacute;, finalmente, hacer frente 
				al proyecto &eacute;l mismo.&#8221; (&#8220;World Wide Web&#8221;, 2012).</p>
				<p>
				Tim Berners-Lee es considerado el padre de la <em class="glossterm">web</em> (&#8220;Tim 
				Berners-Lee&#8221;, 2012), &eacute;l &#8220;intent&oacute; desde el principio incluir 
				informacion sem&aacute;ntica en su creaci&oacute;n, la <a class="glossterm" href="#WWW"><em class="glossterm">World Wide Web</em></a>, pero por 
				diferentes causas no fue posible.2 Por ese motivo introdujo el 
				concepto de sem&aacute;ntica con la intenci&oacute;n de recuperar dicha 
				omisi&oacute;n.&#8221;. Sin embargo como se puede apreciar en la Figura 3, Tim 
				Berners-Lee tiene una visi&oacute;n de dos partes para el futuro de la 
				<em class="glossterm">Web</em>. La primera parte es hacer de la <em class="glossterm">Web</em> un medio m&aacute;s colaborativo. 
				La segunda parte es hacer la <em class="glossterm">Web</em> entendible, y tambi&eacute;n procesable, 
				por m&aacute;quinas. La Figura 3 es el diagrama original de Tim 
				Berners-Lee de su visi&oacute;n (Daconta et al., 2003).</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura03.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 3. Web original propuesta al CERN.</p>
					</div></div>
				<p>
				Es claro que la visi&oacute;n original involucraba m&aacute;s que recuperar 
				<em class="glossterm">p&aacute;ginas HTML</em> de los <em class="glossterm">servidores Web</em>. En la figura se aprecian 
				relaciones entre &iacute;tems de informaci&oacute;n como &#8220;incluye&#8221;, &#8220;describe&#8221; y 
				&#8220;escrito&#8221;. Desafortunadamente, estas relaciones entre recursos 
				actualmente no est&aacute;n capturadas en la <em class="glossterm">Web</em> (Daconta et al., 
				2003).</p>
				<p>
				Durante la evoluci&oacute;n de la <em class="glossterm">Web</em>, ha habido ciertas tecnolog&iacute;as que 
				han surgido y evolucionado a la par con la <em class="glossterm">Web</em>, en especial el 
				campo de los lenguajes de marcas ha sido crucial para el desarrollo 
				de la <em class="glossterm">Web</em>. Lenguajes como <em class="glossterm">HTML</em>, <em class="glossterm">XML</em>, <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a>, <em class="glossterm">RDF</em>, <em class="glossterm">RDFS</em>, <em class="glossterm">OWL</em> han 
				marcado la evoluci&oacute;n de la <em class="glossterm">Web</em>. Los Lenguajes de Marcas son 
				sistemas complejos de descripci&oacute;n de informaci&oacute;n, normalmente 
				documentos, que si se ajustan a <em class="glossterm">SGML</em>, se pueden controlar desde 
				cualquier editor ASCII, entiendo que las Marcas son c&oacute;digos que 
				indican a un programa c&oacute;mo debe tratar su contenido (Hern&aacute;ndez y 
				Zuluaga, 2008). Por su parte, <em class="glossterm">SGML</em> &#8220;son las siglas de <em class="glossterm">Standard Generalized Markup Language o "Lenguaje de Marcado Generalizado"</em>. Consiste en un sistema para la organizaci&oacute;n y 
				etiquetado de documentos. La Organizaci&oacute;n Internacional de 
				Est&aacute;ndares (ISO) normaliz&oacute; este lenguaje en 1986. El lenguaje <em class="glossterm">SGML</em> 
				sirve para especificar las reglas de etiquetado de documentos y no 
				impone en s&iacute; ning&uacute;n conjunto de etiquetas en especial. El lenguaje 
				<em class="glossterm">HTML</em> est&aacute; definido en t&eacute;rminos del <em class="glossterm">SGML</em>. <em class="glossterm">XML</em> es un est&aacute;ndar de 
				creaci&oacute;n posterior, que incorpora un subconjunto de la 
				funcionalidad del <em class="glossterm">SGML</em> (suficiente para las necesidades comunes), y 
				resulta m&aacute;s sencillo de implementar pues evita algunas 
				caracter&iacute;sticas avanzadas de <em class="glossterm">SGML</em>.&#8221;, es una tecnolog&iacute;a est&aacute;ndar ISO 
				para definir lenguajes de marcas generalizados para documentos y 
				corresponde al ISO 8879:1986 <em class="glossterm">SGML</em> (&#8220;SGML&#8221;, 2012), los or&iacute;genes de 
				<em class="glossterm">SGML</em> se remontan a &#8220;un lenguaje inventado por IBM en los a&ntilde;os 
				setenta, llamado GML (Generalized Markup Language), que surgi&oacute; por 
				la necesidad que ten&iacute;a la empresa de almacenar grandes cantidades 
				de informaci&oacute;n.&#8221;, fue cuando la ISO fij&oacute; su atenci&oacute;n en &eacute;l, 
				normaliz&aacute;ndolo para crear el est&aacute;ndar (&#8220;XML&#8221;, 2012).</p>
				<p>
				La <em class="glossterm">Web</em> actual desde su nacimiento hasta el presente ha sido 
				presentada por medio del lenguaje de marcas <em class="glossterm">HTML</em>, &#8220;siglas de 
				<em class="glossterm">HyperText Markup Language (Lenguaje de Marcas de Hipertexto)</em>, es el 
				lenguaje de marcado predominante para la construcci&oacute;n de <em class="glossterm">p&aacute;ginas web</em>. Es usado para describir la estructura y el contenido en forma 
				de texto, as&iacute; como para complementar el texto con objetos tales 
				como im&aacute;genes.&#8221;, al inicio &#8220;La primera descripci&oacute;n de <em class="glossterm">HTML</em> 
				disponible p&uacute;blicamente fue un documento llamado HTML Tags 
				(Etiquetas HTML), publicado por primera vez en Internet por Tim 
				Berners-Lee en 1991.1 2 Describe 22 elementos comprendiendo el 
				dise&ntilde;o inicial y relativamente simple de <em class="glossterm">HTML</em>. Trece de estos 
				elementos todav&iacute;a existen en <em class="glossterm">HTML</em> 4.3 Berners-Lee consideraba a 
				<em class="glossterm">HTML</em> una ampliaci&oacute;n de <em class="glossterm">SGML</em>, pero no fue formalmente reconocida 
				como tal hasta la publicaci&oacute;n de mediados de 1993, por la IETF, de 
				una primera proposici&oacute;n para una especificaci&oacute;n de <em class="glossterm">HTML</em>: el boceto 
				<a class="glossterm" href="#HTML"><em class="glossterm">Hypertext Markup Language</em></a> de Berners-Lee y Dan Connolly, el cual 
				inclu&iacute;a una Definici&oacute;n de Tipo de Documento <em class="glossterm">SGML</em> para definir la 
				gram&aacute;tica.&#8221; (&#8220;HTML&#8221;, 2012).</p>
				<p>
				<em class="glossterm">XML</em> es otro de los lenguajes de marcas que han tenido gran 
				incidencia en la evoluci&oacute;n de la <em class="glossterm">Web</em>, son las &#8220;siglas en ingl&eacute;s de 
				<em class="glossterm">Extensible Markup Language (lenguaje de marcas extensible)</em>, es un 
				metalenguaje extensible de etiquetas desarrollado por el <em class="glossterm">World Wide Web Consortium (W3C)</em>. Es una simplificaci&oacute;n y adaptaci&oacute;n del <em class="glossterm">SGML</em> y 
				permite definir la gram&aacute;tica de lenguajes espec&iacute;ficos (de la misma 
				manera que <em class="glossterm">HTML</em> es a su vez un lenguaje definido por <em class="glossterm">SGML</em>). Por lo 
				tanto <em class="glossterm">XML</em> no es realmente un lenguaje en particular, sino una 
				manera de definir lenguajes para diferentes necesidades. Algunos de 
				estos lenguajes que usan <em class="glossterm">XML</em> para su definici&oacute;n son <em class="glossterm">XHTML</em>, SVG, 
				MathML. <em class="glossterm">XML</em> no ha nacido s&oacute;lo para su aplicaci&oacute;n en Internet, sino 
				que se propone como un est&aacute;ndar para el intercambio de informaci&oacute;n 
				estructurada entre diferentes plataformas. Se puede usar en bases 
				de datos, editores de texto, hojas de c&aacute;lculo y casi cualquier cosa 
				imaginable. <em class="glossterm">XML</em> es una tecnolog&iacute;a sencilla que tiene a su alrededor 
				otras que la complementan y la hacen mucho m&aacute;s grande y con unas 
				posibilidades mucho mayores. Tiene un papel muy importante en la 
				actualidad ya que permite la compatibilidad entre sistemas para 
				compartir la informaci&oacute;n de una manera segura, fiable y f&aacute;cil.&#8221; 
				(&#8220;XML&#8221;, 2012). <em class="glossterm">XML</em> no es una nueva tecnolog&iacute;a. <em class="glossterm">XML</em> es un 
				subconjunto de <em class="glossterm">SGML</em> que fue inventado en 1969 por el Dr. Charles 
				Goldfarb, Ed Mosher, y Ray Lorie. As&iacute; que, los conceptos para <em class="glossterm">XML</em> 
				fueron ideados hace 30 a&ntilde;os y continuamente perfeccionados, 
				probados, y ampliamente implementados. En pocas palabras, <em class="glossterm">XML</em> es 
				&#8220;<em class="glossterm">SGML</em> para la <em class="glossterm">Web</em>&#8221;. <em class="glossterm">XML</em> no es un lenguaje; realmente es un conjunto 
				de reglas sint&aacute;cticas para crear lenguajes de marcas ricos 
				sem&aacute;nticamente en un dominio particular. En otras palabras, se 
				aplica <em class="glossterm">XML</em> para crear nuevos lenguajes. Cualquier lenguaje creado 
				v&iacute;a las reglas de <em class="glossterm">XML</em>, como Math Markup Language (MathML), es 
				llamado una aplicaci&oacute;n de <em class="glossterm">XML</em> (Daconta et al., 2003). Para 2009, 
				cientos de lenguajes basados en <em class="glossterm">XML</em> han sido desarrollados, 
				incluyendo RSS, Atom, SOAP, y <em class="glossterm">XHTML</em>. Formatos basados en <em class="glossterm">XML</em> se han 
				convertido en la opci&oacute;n predeterminada para m&aacute;s herramientas 
				productivas de oficina, incluyendo Microsoft Office (Office Open 
				XML), OpenOffice.org (OpenDocument), e iWork de Apple (&#8220;XML&#8221;, 
				2012). La Figura 4 muestra un esquema del universo de los lenguajes 
				de marca.</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura04.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 4. Universo de los principales lenguajes de marca.</p>
					</div></div>
				<p>
				Otro lenguaje relevante para la construcci&oacute;n de la <em class="glossterm">Web</em> actual es 
				<a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a>, &#8220;es un lenguaje de esquema utilizado para describir la 
				estructura y las restricciones de los contenidos de los documentos 
				<em class="glossterm">XML</em> de una forma muy precisa, m&aacute;s all&aacute; de las normas sint&aacute;cticas 
				impuestas por el propio lenguaje <em class="glossterm">XML</em>. Se consigue as&iacute; una 
				percepci&oacute;n del tipo de documento con un nivel alto de abstracci&oacute;n. 
				Fue desarrollado por el <em class="glossterm">World Wide Web Consortium (W3C)</em> y alcanz&oacute; 
				el nivel de recomendaci&oacute;n en mayo de 2001.&#8221; (&#8220;XML_Schema&#8221;, 2009). 
				<a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a> en un lenguaje de definici&oacute;n que hace posible restringir 
				documentos <em class="glossterm">XML</em> conformes a un vocabulario espec&iacute;fico y una 
				estructura jer&aacute;rquica espec&iacute;fica. <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a> se volvi&oacute; una 
				Recomendaci&oacute;n W3C (sin&oacute;nimo con est&aacute;ndar) en Mayo 5, 2001. <em class="glossterm">XML</em> 
				Schema no es el &uacute;nico lenguaje de definici&oacute;n, y se podr&iacute;a o&iacute;r 
				acerca de otros como Document Type Definitions (DTD's), RELAX 
				NG, y Schematron. Es decir que <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a> es un lenguaje de 
				definici&oacute;n de marca que define los nombres legales para elementos y 
				atributos, y la estructura jer&aacute;rquica legal del documento (Daconta 
				et al., 2003).</p>
				<p>
				Si bien <em class="glossterm">HTML</em> ha sido el protagonista desde el nacimiento de la <em class="glossterm">Web</em>, 
				aportando las bases para la construcci&oacute;n de lo que es la <em class="glossterm">Web</em> 
				actualmente, &eacute;ste s&oacute;lo logr&oacute; capturar una parte de la visi&oacute;n de la 
				<em class="glossterm">Web</em> que tuvo su creador; el <em class="glossterm">HTML</em> captur&oacute; la esencia de documentos 
				de hipermedia enlazados mundialmente a trav&eacute;s de Internet, pero la 
				visi&oacute;n m&aacute;s completa de la <em class="glossterm">Web</em> comprend&iacute;a una serie de relaciones 
				m&aacute;s complejas entre los recursos accesibles a trav&eacute;s de la <em class="glossterm">Web</em>, 
				algo m&aacute;s complejo que el despliegue de documentos y los enlaces 
				entre &eacute;stos; la parte referente a la sem&aacute;ntica de la <em class="glossterm">Web</em> qued&oacute; 
				relegada y con ella el nivel de compenetraci&oacute;n humano-m&aacute;quina y 
				m&aacute;quina-m&aacute;quina, y con esto la visi&oacute;n de una <em class="glossterm">Web</em> inteligente donde 
				las m&aacute;quinas pod&iacute;an entender la informaci&oacute;n que conten&iacute;an y donde 
				las m&aacute;quinas pod&iacute;an procesar el significado de los documentos para 
				entregar informaci&oacute;n mejor contextualizada y m&aacute;s acertada a los 
				usuarios, qued&oacute; pospuesta.</p>
				<p>
					Con la posterior adopci&oacute;n a gran escala de <em class="glossterm">XML</em>, los lenguajes y 
					sintaxis necesarias para completar la informaci&oacute;n <em class="glossterm">Web</em> con esta 
					meta-data complementaria surgieron, y los esfuerzos por construir 
					una <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a> fueron renovados. <em class="glossterm">XML</em> presenta caracter&iacute;sticas 
					importantes en el contexto de la meta-data y por consiguiente de 
					la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>, Daconta et al. (2003) mencionan las siguientes:
					</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
							<p>
							Usando una sintaxis est&aacute;ndar y abierta, y descripciones 
							completas del significado de los datos, <em class="glossterm">XML</em> es legible y 
							entendible para todo el mundo-no s&oacute;lo la aplicaci&oacute;n y persona 
							que los produce. Este es un apuntalamiento cr&iacute;tico de la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>, porque no se puede predecir la variedad de agentes 
							software y sistemas que necesitar&aacute;n consumir datos en la <a class="glossterm" href="#WWW"><em class="glossterm">World Wide Web</em></a>. Un beneficio adicional de guardar datos en <em class="glossterm">XML</em>, m&aacute;s 
							que datos binarios, es que pueden ser buscados tan f&aacute;cil como 
							<em class="glossterm">p&aacute;ginas Web</em>.</p>
						</li><li class="listitem">
							<p>
							El segundo logro clave es que <em class="glossterm">XML</em> provee una sintaxis simple y 
							estandarizada para codificar el significado de valores de datos, 
							o meta data. Una definici&oacute;n usada frecuentemente de meta data es 
							&#8220;datos acerca de datos&#8221;. Lo importante es que <em class="glossterm">XML</em> estandariza un 
							m&eacute;todo simple basado en texto para codificar meta data. En otras 
							palabras, <em class="glossterm">XML</em> provee un mecanismo simple y robusto para 
							codificar informaci&oacute;n sem&aacute;ntica, o el significado de los datos. 
							Es claro que los datos son los valores crudos espec&iacute;ficos del 
							contexto y la meta data denota el significado o prop&oacute;sito de 
							dichos valores.</p>
						</li><li class="listitem">
							<p>
							El tercer mayor logro de <em class="glossterm">XML</em> es estandarizar una estructura 
							conveniente para expresar informaci&oacute;n sem&aacute;ntica para ambos 
							documentos y campos de datos. La estructura que <em class="glossterm">XML</em> usa es una 
							jerarqu&iacute;a o estructura de &aacute;rbol. La estructura jer&aacute;rquica 
							permite al usuario descomponer un concepto en sus partes 
							componentes de una manera recursiva.</p>
						</li><li class="listitem">
							<p>
							El &uacute;ltimo logro de <em class="glossterm">XML</em> es que no es una tecnolog&iacute;a nueva. <em class="glossterm">XML</em> es 
							un subconjunto del Standarized Generalized Markup Language 
							(<em class="glossterm">SGML</em>) que fue inventado en 1969 por el Dr. Charles Goldfarb, Ed 
							Mosher, y Ray Lorie. As&iacute; que los conceptos para <em class="glossterm">XML</em> fueron 
							ideados hace casi 30 a&ntilde;os y continuamente perfeccionados, 
							probados, y ampliamente implementados. En s&iacute;ntesis, <em class="glossterm">XML</em> es &#8220;<em class="glossterm">SGML</em> 
							para la <em class="glossterm">Web</em>.&#8221;. As&iacute; que deber&iacute;a ser claro que <em class="glossterm">XML</em> posee algunas 
							simples valiosas proposiciones que compelen a continuar el 
							manejo de su adopci&oacute;n.</p>
						</li></ul></div><p>
				</p>
				<p>
				<em class="glossterm">XML</em> tiene muchas de las caracter&iacute;sticas que son importantes para la 
				<a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>, y es por intermedio de <em class="glossterm">XML</em> que surge <em class="glossterm">RDF</em>, el 
				<a class="glossterm" href="#RDF"><em class="glossterm">Resource Description Framework</em></a> es un lenguaje basado en <em class="glossterm">XML</em> para 
				describir recursos. Mientras que los documentos <em class="glossterm">XML</em> adjuntan meta 
				data a partes de un documento, un uso de <em class="glossterm">RDF</em> es crear meta data 
				acerca del documento como una entidad autosuficiente. En otras 
				palabras, en vez de marcar los aspectos internos de un documento, 
				<em class="glossterm">RDF</em> captura meta data acerca de los aspectos &#8220;externos&#8221; de un 
				documento, como el autor, la fecha de creaci&oacute;n, y tipo (Daconta et 
				al., 2003). <em class="glossterm">RDF</em> es una Recomendaci&oacute;n W3C dise&ntilde;ada para estandarizar 
				la definici&oacute;n y uso de descripciones meta-data de recursos basados 
				en <em class="glossterm">Web</em>. Sin embargo, <em class="glossterm">RDF</em> es igualmente bien apropiada para 
				representar datos. <em class="glossterm">RDF</em> usa <em class="glossterm">XML</em> como su sintaxis de serializaci&oacute;n. 
				Como con <em class="glossterm">XML</em>, el modelo de datos <em class="glossterm">RDF</em> no provee mecanismos para 
				declarar nombres de propiedades que van a ser usadas (Davies et 
				al., 2003). <em class="glossterm">RDF</em> es un lenguaje basado en <em class="glossterm">XML</em> para describir 
				informaci&oacute;n contenida en un recurso <em class="glossterm">Web</em> (Yu, 2007).</p>
				<p>
				<a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> es un lenguaje en la capa superior de <em class="glossterm">RDF</em>. Si se usan 
				las aserciones basadas en tripletas de <em class="glossterm">RDF</em> para denotar una clase, 
				propiedad de clase, y valor, se pueden crear jerarqu&iacute;as de clase 
				para la clasificaci&oacute;n y descripci&oacute;n de objetos. Este es el objetivo 
				de <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a>. <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> es un conjunto simple de recursos y 
				propiedades <em class="glossterm">RDF</em> est&aacute;ndar que hacen posible que la gente cree sus 
				propios vocabularios <em class="glossterm">RDF</em>. El modelo de datos expresado por RDF 
				Schema es el mismo modelo de datos usado por lenguajes de 
				programaci&oacute;n orientados a objetos como Java. El modelo de datos 
				para <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> permite crear clases de datos. Una clase es 
				definida como un grupo de cosas con caracter&iacute;sticas comunes. En 
				POO, una clase es definida como una plantilla o molde para un 
				objeto compuesto de caracter&iacute;sticas (tambi&eacute;n llamadas variables 
				miembro) y comportamientos (tambi&eacute;n llamados m&eacute;todos). Un objeto es 
				una instancia de una clase. <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> s&oacute;lo usa el nombre de la 
				clase y los atributos, ya que es para modelamiento de datos y no 
				programaci&oacute;n de comportamientos (Daconta et al., 2003). <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> 
				da un paso adelante para un formalismo de representaci&oacute;n m&aacute;s rico e 
				introduce primitivas b&aacute;sicas de modelamiento <em class="glossterm">ontol&oacute;gico</em> en la <em class="glossterm">Web</em>. 
				Con <em class="glossterm">RDFS</em>, se puede hablar de clases, subclases, sub-propiedades, 
				propiedades de restricci&oacute;n de dominio y rango, y mucho m&aacute;s en un 
				contexto basado en <em class="glossterm">Web</em>. A pesar de la similitud en sus nombres, 
				<em class="glossterm">RDFS</em> cumple un rol diferente a <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a>. <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a>, y tambi&eacute;n 
				los DTD&#8217;s, prescriben el orden y combinaci&oacute;n de etiquetas en un 
				documento <em class="glossterm">XML</em>. En contraste, <em class="glossterm">RDFS</em> s&oacute;lo provee informaci&oacute;n acerca de 
				la interpretaci&oacute;n de sentencias dadas en un modelo de datos <em class="glossterm">RDF</em>, 
				pero no restringe la apariencia sint&aacute;ctica de una descripci&oacute;n <em class="glossterm">RDF</em>. 
				<em class="glossterm">RDFS</em> deja a los desarrolladores definir un vocabulario particular 
				para datos <em class="glossterm">RDF</em> y especifica los tipos de objetos a los cuales esos 
				atributos pueden ser aplicados. En otras palabras, el mecanismo 
				<em class="glossterm">RDFS</em> provee un sistema b&aacute;sico de tipos para modelos <em class="glossterm">RDF</em>. Las 
				expresiones <em class="glossterm">RDFS</em> tambi&eacute;n son expresiones <em class="glossterm">RDF</em> v&aacute;lidas (justo como 
				las expresiones <a class="glossterm" href="#XML Schema"><em class="glossterm">XML Schema</em></a> son <em class="glossterm">XML</em> v&aacute;lido) (Davies et al., 2003). 
				<em class="glossterm">RDFS</em> est&aacute; escrito en <em class="glossterm">RDF</em>. <em class="glossterm">RDFS</em> especifica un vocabulario que define 
				clases, subclases, variables miembro de clases, y tambi&eacute;n las 
				relaciones entre estas clases. La realidad es que este vocabulario 
				siempre estar&aacute; ausente en el mundo <em class="glossterm">RDF</em>. Como se puede ver, <em class="glossterm">RDF</em> 
				puede ser usado para describir recursos en una forma estructurada 
				que las m&aacute;quinas puedan procesar; tambi&eacute;n puede ser usado para 
				establecer relaciones entre estos recursos de modo que las m&aacute;quinas 
				puedan ser dotadas con capacidades de razonamiento b&aacute;sico. Sin 
				embargo, este no define el vocabulario usado; es decir, <em class="glossterm">RDF</em> no dice 
				nada acerca de clases, subclases y las relaciones que podr&iacute;a 
				existir entre estas clases. El hecho de que este vocabulario 
				siempre este ausente no tendr&iacute;a ninguna implicaci&oacute;n. Los documentos 
				<em class="glossterm">RDF</em> pueden todav&iacute;a ser usados como un conjunto de sentencias 
				autosuficientes. Sin embargo, esta capacidad ser&aacute; muy limitada y 
				nunca puede alcanzar el nivel global que se busca. Para hacer la 
				informaci&oacute;n distribuida y los datos por Internet m&aacute;s 
				m&aacute;quina-amigables y m&aacute;quina-procesables, se necesita dicho 
				vocabulario, y, de otra vez, se tendr&aacute; que crear este diccionario. 
				Es as&iacute; que <em class="glossterm">RDFS</em> es usado para crear dicho vocabulario. Puede ser 
				visto como un lenguaje de descripci&oacute;n de vocabulario <em class="glossterm">RDF</em>. <em class="glossterm">RDFS</em> en 
				conjunto con las sentencias <em class="glossterm">RDF</em> empujar&aacute;n la Internet un paso 
				adelante hacia la legibilidad de m&aacute;quinas, y este paso adicional no 
				puede ser logrado s&oacute;lo por <em class="glossterm">RDF</em>. Para resumir, <em class="glossterm">RDFS</em> es un lenguaje 
				que se puede usar para crear un vocabulario para describir clases, 
				subclases, y propiedades de recursos <em class="glossterm">RDF</em>; es una Recomendaci&oacute;n W3C; 
				el lenguaje <em class="glossterm">RDFS</em> tambi&eacute;n asocia las propiedades con las clases que 
				define; <em class="glossterm">RDFS</em> puede agregar sem&aacute;ntica a los predicados y recursos 
				<em class="glossterm">RDF</em>: define el significado de un t&eacute;rmino dado especificando sus 
				propiedades y qu&eacute; tipo de objetos pueden ser los valores de estas 
				propiedades. Como se ha mencionado antes, <em class="glossterm">RDFS</em> est&aacute; escrito en <em class="glossterm">RDF</em>. 
				De hecho, no s&oacute;lo est&aacute; escrito en <em class="glossterm">RDF</em>, sino que <em class="glossterm">RDFS</em> tambi&eacute;n usa el 
				mismo modelo de datos que <em class="glossterm">RDF</em>. En este sentido, <em class="glossterm">RDFS</em> puede ser 
				visto como una extensi&oacute;n de <em class="glossterm">RDF</em> (Yu, 2007).</p>
				<p>
				<em class="glossterm">OWL</em> es el m&aacute;s reciente, m&aacute;s sofisticado y de m&aacute;s alta jerarqu&iacute;a en 
				las capas de la &#8220;Pila de la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>&#8221; (ver Figura 3) de los 
				lenguajes de marcas que son relevantes en la evoluci&oacute;n de la <em class="glossterm">Web</em> 
				hacia una <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>, &#8220;es el acr&oacute;nimo del ingl&eacute;s <em class="glossterm">Ontology Web Language</em>, un lenguaje de marcado para publicar y compartir datos 
				usando <em class="glossterm">ontolog&iacute;as</em> en la WWW. <em class="glossterm">OWL</em> tiene como objetivo facilitar un 
				modelo de marcado construido sobre <em class="glossterm">RDF</em> y codificado en <em class="glossterm">XML</em>. Tiene 
				como antecedente DAML+OIL, en los cuales se inspiraron los 
				creadores de <em class="glossterm">OWL</em> para crear el lenguaje. Junto al entorno <em class="glossterm">RDF</em> y 
				otros componentes, estas herramientas hacen posible el proyecto de 
				<a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a>.&#8221; (&#8220;OWL&#8221;, 2009). <a class="glossterm" href="#OWL"><em class="glossterm">Web Ontology Language</em></a> (a veces 
				referido como <em class="glossterm">Ontology Web Language</em>) es el m&aacute;s expresivo de los 
				lenguajes de <em class="glossterm">ontolog&iacute;as</em> actualmente definidos o que est&aacute;n siendo 
				definidos para la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>. <em class="glossterm">OWL</em> se origin&oacute; como un lenguaje 
				patrocinado por el <em class="glossterm">World Wide Web Consortium (W3C)</em>. El Web Ontology 
				Working Group del W3C fue formado en Noviembre de 2001, y la 
				primera versi&oacute;n oficial de <em class="glossterm">OWL</em> estuvo disponible en el 2003. <em class="glossterm">OWL</em> 
				tiene tres niveles del lenguaje: OWL Lite, OWL DL (por description 
				logic), y OWL Full. Estos tres niveles est&aacute;n en orden creciente de 
				expresividad. Los niveles m&aacute;s altos del lenguaje contienen los 
				niveles m&aacute;s bajos y tambi&eacute;n extienden los niveles m&aacute;s bajos 
				(Daconta et al., 2003). <em class="glossterm">OWL</em> es la &uacute;ltima recomendaci&oacute;n del W3C, y 
				es probablemente el lenguaje m&aacute;s popular para crear <em class="glossterm">ontolog&iacute;as</em> hoy. 
				Est&aacute; construido sobre <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a>.</p>
				<p>
				<em class="glossterm">OWL</em> = <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> + nuevas construcciones para expresividad</p>
				<p>
				Adem&aacute;s, todas las clases y propiedades provistas por <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> 
				pueden ser usadas al crear un documento <em class="glossterm">OWL</em>. <em class="glossterm">OWL</em> y <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> 
				tienen el mismo prop&oacute;sito: definir clases, propiedades, y sus 
				relaciones. Sin embargo, comparado a <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a>, <em class="glossterm">OWL</em> da la 
				capacidad de expresar relaciones mucho m&aacute;s complicadas y ricas. El 
				resultado final es que se pueden construir agentes o herramientas 
				con la capacidad de raciocinio grandemente aumentada. Adem&aacute;s, 
				frecuentemente se querr&aacute; usar <em class="glossterm">OWL</em> para el prop&oacute;sito del desarrollo 
				de <em class="glossterm">ontolog&iacute;as</em>; <a class="glossterm" href="#RDFS"><em class="glossterm">RDF Schema</em></a> a&uacute;n es una opci&oacute;n v&aacute;lida, pero sus obvias 
				limitaciones comparado a <em class="glossterm">OWL</em> siempre lo har&aacute;n una segunda opci&oacute;n 
				(Yu, 2007).</p>
				<p>
				Son esta serie de tecnolog&iacute;as y lenguajes las que sentaron un 
				precedente importante para la evoluci&oacute;n de la <em class="glossterm">Web</em> y que constituyen 
				las bases sobre las que se fundamenta la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>, tal y como 
				se puede apreciar en la llamada &#8220;Pila de la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>&#8221; 
				presentada por el W3C y Tim Berners-Lee.</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura05.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 5. Pila de la web sem&aacute;ntica.</p>
					</div></div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e802"></a>
				RESOURCE DESCRIPTION FRAMEWORK (RDF), ONTOLOG&Iacute;AS Y WEB 
				SEM&Aacute;NTICA</h3></div></div></div>
				
				<p>
				<em class="glossterm">RESOURCE DESCRIPTION FRAMEWORK (RDF)</em> (Wikipedia, 2012), es un 
				lenguaje de marcado dise&ntilde;ado para expresar informaci&oacute;n acerca de 
				recursos <em class="glossterm">web</em>. Por su naturaleza y el concepto de tripletas en que 
				se basa puede usarse para modelar <em class="glossterm">ontolog&iacute;as</em>. Habiendo sido 
				dise&ntilde;ado como un modelo de datos para meta-datos, es usado como una 
				extensi&oacute;n en la <em class="glossterm">web</em> actual para moldear lo que se entiende como <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a>. Siendo un est&aacute;ndar W3C est&aacute; ampliamente extendido y hay 
				m&uacute;ltiples herramientas concernientes a su uso. <em class="glossterm">RDF</em> como lenguaje para expresar informaci&oacute;n tiene 
				variedad de aplicaciones, las cuales deben encarar numerosos retos 
				y explorar nuevos terrenos.</p>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e811"></a>
					PRINCIPIOS</h4></div></div></div>
					
					<p>
					<em class="glossterm">RDF</em> es un lenguaje de marcado basado en <em class="glossterm">XML</em> (Wikipedia, 2012), 
					dise&ntilde;ado originalmente como un modelo de datos para meta-datos, 
					con el prop&oacute;sito de expresar informaci&oacute;n acerca de recursos 
					principalmente en la <em class="glossterm">web</em>, pero que puede ser usado para expresar 
					informaci&oacute;n acerca de recursos de cualquier tipo o en cualquier 
					contexto.</p>
					<p>
						Algunos hechos y principios que se deben saber acerca de <em class="glossterm">RDF</em> son 
						los siguientes (Yu, 2007; pp. 40):
						</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> es un lenguaje recomendado por W3C (W3C, 2004), y es acerca 
								de meta-datos.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> es un est&aacute;ndar para meta-datos.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> puede describir cualquier recurso independientemente del 
								dominio.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> provee las bases para codificar, intercambiar, y reusar 
								meta-datos estructurados.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> es estructurado, esto es, entendible por las m&aacute;quinas. Las 
								m&aacute;quinas pueden ejecutar operaciones &uacute;tiles con el conocimiento 
								expresado en <em class="glossterm">RDF</em>.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> permite interoperabilidad entre aplicaciones intercambiando 
								informaci&oacute;n entendible por m&aacute;quinas en la <em class="glossterm">web</em>.</p>
							</li><li class="listitem">
								<p>
								<em class="glossterm">RDF</em> es para la <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a> lo que <em class="glossterm">HTML</em> es para la <em class="glossterm">Web</em>.</p>
							</li></ul></div><p>
					</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e846"></a>
					RDF Y TRIPLETAS</h4></div></div></div>
					
					<p>
					<em class="glossterm">RDF</em> es en lenguaje de marcado basado en <em class="glossterm">XML</em>, fue concebido como 
					una forma estructurada para modelar meta-datos con el prop&oacute;sito de 
					expresar informaci&oacute;n acerca de recursos.</p>
					<p>
					La forma en que esta informaci&oacute;n acerca de los recursos se expresa 
					es mediante el concepto de sentencia &oacute; grafo dirigido etiquetado; 
					en general, tripletas que expresan informaci&oacute;n acerca de 
					algo.</p>
					<p>
					Una sentencia es de la forma: sujeto - predicado - objeto.</p>
					<p>
					Un grafo es de la forma presentada en la Figura 6.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura06.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 6. Forma b&aacute;sica de un grafo dirigido etiquetado.</p>
						</div></div>
					<p>
					Ambos son tripletas, donde dos nodos/v&eacute;rtices &oacute; un sujeto y objeto 
					est&aacute;n unidos mediante un arco/arista dirigido y etiquetado &oacute; un 
					predicado.</p>
					<p>
					Es esta estructura en la que se basa la sintaxis de <em class="glossterm">RDF</em>, y por s&iacute; 
					misma resulta muy conveniente para modelar complejas estructuras 
					como diagramas de clases, modelos entidad-relaci&oacute;n, <em class="glossterm">ontolog&iacute;as</em> y 
					vocabularios, taxonom&iacute;as, jerarqu&iacute;as, mapas conceptuales, etc. ya 
					que todo este tipo de estructuras se basan en objetos con 
					atributos y relaciones entre ellos. Es esta estructura fundamental 
					de <em class="glossterm">RDF</em> la que permite expresar informaci&oacute;n acerca de 
					recursos.</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e869"></a>
					LOS ELEMENTOS B&Aacute;SICOS DE RDF</h4></div></div></div>
					
					<p>
					<em class="glossterm">RDF</em> logra expresar informaci&oacute;n de cosas y objetos de manera 
					estructurada y procesable por agentes y computadoras usando unos 
					elementos b&aacute;sicos.</p>
					<p>
					Recurso</p>
					<p>
					Como su nombre lo sugiere, <em class="glossterm">RDF</em> se trata de describir recursos. <em class="glossterm">RDF</em> 
					al ser un est&aacute;ndar para meta-datos, ofrece una forma estandarizada 
					para describir informaci&oacute;n acerca de algo, este algo puede ser 
					cualquier cosa (un <a class="glossterm" href="#web site"><em class="glossterm">sitio web</em></a>, una <a class="glossterm" href="#web page"><em class="glossterm">p&aacute;gina web</em></a>, una palabra en una 
					<a class="glossterm" href="#web page"><em class="glossterm">p&aacute;gina web</em></a>, un objeto del mundo real como un libro, un ser humano, 
					un perro), y en el contexto de <em class="glossterm">RDF</em> este algo se denomina recurso. 
					Un recurso es cualquier cosa que pueda ser descrita con 
					expresiones <em class="glossterm">RDF</em> (Yu, 2007; pp. 40).</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura07.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 7. Ejemplo de tripleta en forma de grafo.</p>
						</div></div>
					<p>
					Con la interpretaci&oacute;n de <em class="glossterm">RDF</em> como sentencia, el recurso es el 
					sujeto u objeto de la sentencia.</p>
					<p>
					e.g., Organizaci&oacute;n ejecuta Proceso. Organizaci&oacute;n y Proceso son 
					recursos.</p>
					<p>
					Con la interpretaci&oacute;n de <em class="glossterm">RDF</em> como grafo, los recursos son los 
					nodos/v&eacute;rtices del grafo.</p>
					<p>
					e.g., En la Figura 7., Organizaci&oacute;n y Proceso son recursos.</p>
					<p>
					Propiedad</p>
					<p>
					Una propiedad es un recurso que tiene un nombre y puede ser usado 
					como propiedad, esto es, una propiedad es usada para describir 
					alg&uacute;n aspecto espec&iacute;fico, caracter&iacute;stica, atributo, o relaci&oacute;n de 
					un recurso dado (Yu, 2007; pp. 41).</p>
					<p>
					Con la interpretaci&oacute;n de <em class="glossterm">RDF</em> como sentencia, la propiedad es el 
					predicado.</p>
					<p>
					e.g., Organizaci&oacute;n ejecuta Proceso. ejecuta es la propiedad.</p>
					<p>
					Con la interpretaci&oacute;n de <em class="glossterm">RDF</em> como grafo, la propiedad es el 
					arco/arista.</p>
					<p>
					e.g., En la Figura 7., ejecuta es la propiedad.</p>
					<p>
					Sentencia</p>
					<p>
					Una sentencia <em class="glossterm">RDF</em> es usada para describir propiedades de recursos, 
					tiene el siguiente formato:</p>
					<p>
					recurso (sujeto) + propiedad (predicado) + valor de propiedad 
					(objeto).</p>
					<p>
					El valor de la propiedad puede ser una cadena literal o un 
					recurso. Una sentencia indica que un recurso (el sujeto) est&aacute; 
					enlazado a otro recurso (el objeto) por un arco/arista etiquetado 
					por una relaci&oacute;n (el predicado). Se puede interpretar as&iacute;:</p>
					<p>
					&lt;sujeto&gt; tiene una propiedad &lt;predicado&gt;, cuyo valor 
					es &lt;objeto&gt;. (Yu, 2007; pp. 42).</p>
					<p>
					En la interpretaci&oacute;n de <em class="glossterm">RDF</em> como grafo, la sentencia es el 
					conjunto v&eacute;rtice &#8211; arco &#8211; v&eacute;rtice; e.g., en la Figura 7., la 
					sentencia es todo el conjunto del grafo mostrado, esto, es, el 
					conjunto Organizaci&oacute;n ejecuta Proceso.</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e914"></a>
					RDF Y ONTOLOG&Iacute;AS</h4></div></div></div>
					
					<p>
					Una <em class="glossterm">ontolog&iacute;a</em> en un contexto inform&aacute;tico &#8220;hace referencia a la 
					formulaci&oacute;n de un exhaustivo y riguroso esquema conceptual dentro 
					de uno o varios dominios dados; con la finalidad de facilitar la 
					comunicaci&oacute;n y el intercambio de informaci&oacute;n entre diferentes 
					sistemas y entidades.&#8221; (Wikipedia, 2012).</p>
					<p>
					Es decir que se puede entender <em class="glossterm">ontolog&iacute;a</em> como una entidad o unidad 
					que organiza todo lo existente en el mundo en una jerarqu&iacute;a de 
					categor&iacute;as (Russel y Norvig, 2004; pp. 364), o como la unidad que 
					define las palabras y conceptos comunes (el significado) usados 
					para describir y representar un &aacute;rea del conocimiento (Daconta et 
					al., 2003), o como un producto de ingenier&iacute;a consistente de un 
					vocabulario espec&iacute;fico usado para describir [una parte de] la 
					realidad, m&aacute;s un conjunto expl&iacute;cito de asumpciones que tienen que 
					ver con el significado intencionado de ese vocabulario, en otras 
					palabras, la especificaci&oacute;n de una conceptualizaci&oacute;n (Daconta et 
					al., 2003). Yu (2007; pp. 90) explica que una <em class="glossterm">ontolog&iacute;a</em> define los 
					t&eacute;rminos usados para describir y representar un &aacute;rea de 
					conocimiento, esto es, una <em class="glossterm">ontolog&iacute;a</em> tiene un dominio espec&iacute;fico y 
					define un grupo de t&eacute;rminos en el dominio dado y las relaciones 
					entre ellos.</p>
					<p>
					Importancia de las ontolog&iacute;as</p>
					<p>
						Los siguientes son algunos aspectos relevantes relacionados con 
						las <em class="glossterm">ontolog&iacute;as</em>, as&iacute; como beneficios que ofrecen:
						</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
								<p>
								Proveen un entendimiento/definici&oacute;n com&uacute;n y compartida acerca 
								de conceptos claves en el dominio.</p>
							</li><li class="listitem">
								<p>
								Proveen una forma de reusar conocimiento del dominio.</p>
							</li><li class="listitem">
								<p>
								Hacen las asumpciones del dominio expl&iacute;citas.</p>
							</li><li class="listitem">
								<p>
								Junto con lenguajes de descripci&oacute;n de <em class="glossterm">ontolog&iacute;as</em> (como <em class="glossterm">RDF Schema (RDFS)</em> (W3C, 2004) y <em class="glossterm">Ontology Web Language (OWL)</em> (W3C, 
								2004)), proveen una forma de codificar conocimiento y sem&aacute;ntica 
								que las m&aacute;quinas pueden entender.</p>
							</li><li class="listitem">
								<p>
								Hacen el procesamiento de m&aacute;quinas autom&aacute;tico y en gran escala, 
								posible.</p>
							</li></ul></div><p>
					</p>
					<p>
					La relaci&oacute;n</p>
					<p>
					Como se estableci&oacute;, las <em class="glossterm">ontolog&iacute;as</em> son una forma ampliamente 
					extendida de representar el conocimiento, esto se hace por medio 
					de conceptos, categor&iacute;as, jerarqu&iacute;as, propiedades, atributos, 
					relaciones, etc., lo cual se resume en el uso de conceptos/clases 
					y sus atributos/relaciones.</p>
					<p>
					De igual forma, se vio que el concepto fundamental en el dise&ntilde;o y 
					estructura de <em class="glossterm">RDF</em> son las tripletas, sentencias o grafos que 
					establecen una relaci&oacute;n/predicado entre dos clases/recursos.</p>
					<p>
					Habiendo clarificado lo anterior, se hace evidente la relaci&oacute;n 
					entre <em class="glossterm">RDF</em> y <em class="glossterm">ontolog&iacute;as</em>; el lenguaje <em class="glossterm">RDF</em> puede ser usado para 
					modelar <em class="glossterm">ontolog&iacute;as</em>, dada su capacidad de establecer 
					tripletas.</p>
					<p>
					De hecho existen vocabularios <em class="glossterm">RDF</em>, que son en s&iacute; mismos 
					<em class="glossterm">ontolog&iacute;as</em>, con t&eacute;rminos espec&iacute;ficos para modelar otras <em class="glossterm">ontolog&iacute;as</em> 
					debido a que los t&eacute;rminos que modelan son t&eacute;rminos gen&eacute;ricos para 
					expresar jerarqu&iacute;a (como clase, sub-clase, recurso, propiedad, 
					cosa) y relaciones (como rango, dominio, restricci&oacute;n, 
					cardinalidad, equivalencia); vocabularios <em class="glossterm">RDF</em> como <em class="glossterm">RDFS (RDF Schema)</em> (W3C, 2004) y <em class="glossterm">OWL (Ontology Web Language)</em> (W3C, 2004) son 
					vocabularios gen&eacute;ricos con t&eacute;rminos especializados para modelar 
					<em class="glossterm">ontolog&iacute;as</em>.</p>
					<p>
					Es de aclarar que en el contexto de <em class="glossterm">RDF</em> y <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a> los 
					t&eacute;rminos <em class="glossterm">ontolog&iacute;a</em> y vocabulario se usan indistintamente, un 
					vocabulario es una <em class="glossterm">ontolog&iacute;a</em>, es decir una serie de t&eacute;rminos y 
					relaciones espec&iacute;ficos de un dominio.</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e962"></a>
					RDF Y WEB SEM&Aacute;NTICA</h4></div></div></div>
					
					<p>
					El concepto de <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a> (Wikipedia, 2012) ha co-existido con 
					el concepto de <em class="glossterm">web</em> (Wikipedia, 2012) desde sus inicios, cuando Tim 
					Berners-Lee (Wikipedia, 2012), quien es considerado el creador de 
					la <em class="glossterm">web</em>, present&oacute; su propuesta original (Berners-Lee, 1989), (ver 
					Figura 8.) al CERN (Wikipedia, 2012); son su implementaci&oacute;n y uso 
					los que son recientes.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura08.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 8. Propuesta original de la Web al CERN.</p>
						</div></div>
					<p>
					La <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a> (Wikipedia, 2012) es una extensi&oacute;n de la actual 
					<em class="glossterm">web</em> (Wikipedia, 2012), esto es, informaci&oacute;n adicional en forma de 
					meta-datos con el fin de dar a la informaci&oacute;n un significado, para 
					que las m&aacute;quinas y agentes interpreten esta informaci&oacute;n extendida 
					y procesar m&aacute;s especializadamente los datos, lo que permitir&aacute; un 
					uso mejorado de la informaci&oacute;n. Consecuentemente habr&aacute; mayor 
					sinergia entre maquinas y personas en el trabajo (Yu, 2007; pp. 
					8), adem&aacute;s de una automatizaci&oacute;n, integraci&oacute;n y re-uso de 
					informaci&oacute;n entre aplicaciones (Yu, 2007; pp. 8).</p>
					<p>
					La relaci&oacute;n</p>
					<p>
					Como se estableci&oacute;, la <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a> es una extensi&oacute;n de la <em class="glossterm">web</em> 
					actual, en la cual se usan meta-datos para expresar informaci&oacute;n de 
					contexto (<em class="glossterm">ontolog&iacute;as</em>) para los recursos, que es procesable por 
					agentes.</p>
					<p>
					De igual forma, se vio que <em class="glossterm">RDF</em> fue concebido como un est&aacute;ndar para 
					modelar datos, originalmente en la forma de meta-datos.</p>
					<p>
					Habiendo clarificado lo anterior, se hace evidente la relaci&oacute;n 
					entre <em class="glossterm">RDF</em> y <a class="glossterm" href="#SW"><em class="glossterm">Web Sem&aacute;ntica</em></a>; el lenguaje <em class="glossterm">RDF</em> es usado para asociar 
					meta-datos contextualizadores en forma de vocabularios, a los 
					recursos <em class="glossterm">web</em>; esto finalmente es lo que provee la sem&aacute;ntica 
					(significado) a los recursos, que podr&aacute; ser procesada de diversas 
					formas por los agentes.</p>
				</div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e993"></a>
				FRAMEWORKS Y Yii FRAMEWORK</h3></div></div></div>
				
				<p>
				Como se ha visto, las <em class="glossterm">TI</em> y la <em class="glossterm">web</em> evolucionan exponencialmente, y 
				uno de los hitos destacados en esta evoluci&oacute;n de tecnolog&iacute;as fue la 
				introducci&oacute;n de los <em class="glossterm">frameworks</em>, definidos de la siguiente 
				manera:</p>
				<p>
				La palabra inglesa "<a class="glossterm" href="#framework"><em class="glossterm">framework</em></a>" (marco de trabajo) define, 
				en t&eacute;rminos generales, un conjunto estandarizado de conceptos, 
				pr&aacute;cticas y criterios para enfocar un tipo de problem&aacute;tica 
				particular que sirve como referencia, para enfrentar y resolver 
				nuevos problemas de &iacute;ndole similar.</p>
				<p>
				En el desarrollo de software, un <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> o infraestructura 
				digital, es una estructura conceptual y tecnol&oacute;gica de soporte 
				definido, normalmente con artefactos o m&oacute;dulos desoftware 
				concretos, con base a la cual otro proyecto de software puede ser 
				m&aacute;s f&aacute;cilmente organizado y desarrollado. T&iacute;picamente, puede 
				incluir soporte de programas,bibliotecas, y un lenguaje 
				interpretado, entre otras herramientas, para as&iacute; ayudar a 
				desarrollar y unir los diferentes componentes de un proyecto.</p>
				<p>
				Representa una arquitectura de software que modela las relaciones 
				generales de las entidades del dominio, y provee una estructura y 
				una especial metodolog&iacute;a de trabajo, la cual extiende o utiliza las 
				aplicaciones del dominio.</p>
				<p>
				Son piezas de ingenier&iacute;a de software que al tener estructura 
				definida facilitan el desarrollo de tareas comunes y repetitivas, 
				al mismo tiempo que dan una estructura modular y profesional a las 
				aplicaciones desarrolladas con ellos; de este modo el proceso de 
				desarrollo se agiliza, potencia y sofistica dejando v&iacute;a libre al 
				enfoque en el business core (n&uacute;cleo de negocio) y a la 
				customizacion (personalizaci&oacute;n) de los componentes predefinidos, 
				generalmente vistas y dem&aacute;s aspectos visuales para el usuario 
				final.</p>
				<p>
				Un ejemplo en el mundo real y en producci&oacute;n de uno de estos 
				<em class="glossterm">frameworks</em> es Yii. Yii es un <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> orientado a objetos, 
				software libre, de alto rendimiento basado en componentes, PHP 
				y <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> de <em class="glossterm">aplicaciones web</em>. Yii se pronuncia en espa&ntilde;ol como 
				se escribe y es un acr&oacute;nimo para "Yes It Is!" (en 
				espa&ntilde;ol: &iexcl;S&iacute; lo es!).</p>
				<p>
				De la p&aacute;gina oficial de Yii se tiene la siguiente descripci&oacute;n del 
				<a class="glossterm" href="#framework"><em class="glossterm">framework</em></a>:</p>
				<p>
				Yii es un <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> de desarrollo de <em class="glossterm">aplicaciones web</em> libre y 
				<em class="glossterm">open-source (c&oacute;digo abierto)</em> escrito en PHP5 que promueve dise&ntilde;o 
				limpio, DRY y alienta desarrollo r&aacute;pido. Trabaja para agilizar el 
				desarrollo de aplicaciones y ayuda a asegurar un producto final 
				extremadamente eficiente, extensible y mantenible.</p>
				<p>
				Siendo extremadamente optimizado en rendimiento, Yii es una opci&oacute;n 
				perfecta para proyectos de cualquier tama&ntilde;o. Sin embargo, ha sido 
				constru&iacute;do con aplicaciones empresariales y sofisticadas en mente. 
				Se tiene control total sobre la configuraci&oacute;n de la cabeza a los 
				pies (presentaci&oacute;n a persistencia) para ajustarse a las gu&iacute;as de 
				desarrollo empresarial usadas. Viene empaquetado con herramientas 
				para ayudar a probar y depurar las aplicaciones, y tiene 
				documentaci&oacute;n clara y completa.</p>
				<p>
				<em class="glossterm">Frameworks</em> de este tipo resultan muy &uacute;tiles y eficientes para 
				proyectos que tendr&aacute;n una estructura y aspecto est&aacute;ndar, donde el 
				dise&ntilde;o novedoso no es fundamental, prevalece la funcionalidad sobre 
				el dise&ntilde;o, y los usuarios finales est&aacute;n familiarizados con cierta 
				UI t&iacute;pica.</p>
				<p>
				Y siendo Yii un <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> para desarrollo de <em class="glossterm">aplicaciones web</em> 
				<em class="glossterm">open-source</em> que se soporta en tecnolog&iacute;as y arquitectura est&aacute;ndar 
				se hace como un candidato &oacute;ptimo para su uso en la construcci&oacute;n de 
				<em class="glossterm">aplicaciones web</em> tradicionales con funcionalidades 
				particulares.</p>
			</div>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1024"></a>
			ENTORNO Y STACK DE COMPONENTES (XAMPP)</h2></div></div></div>
			
			<p>
			Todo software/programa/aplicaci&oacute;n requiere de un entorno de 
			ejecuci&oacute;n, plataforma, arquitectura, pila de componentes, pila de la 
			aplicaci&oacute;n, o stack de componentes; en el caso de las <em class="glossterm">aplicaciones web</em>, el stack de componentes requerido se compone de un S.O. (Linux, 
			Windows, Mac OS X, Unix, etc.) que soporte otras aplicaciones de un 
			nivel un poco m&aacute;s alto como los SGBD (MySQL, PostgreSQL, Oracle, SQL 
			Server, Informix, etc.) y los <em class="glossterm">servidores web</em> (Apache, IIS, nginx, 
			etc.), que a su vez soportan otras aplicaciones y tecnolog&iacute;as de m&aacute;s 
			alto nivel como los lenguajes/aplicaciones CGI (PHP, Perl, ASP.NET, 
			JSP, RoR, etc.), est&aacute;ndares <em class="glossterm">web</em> (<em class="glossterm">HTML</em>, CSS, JS, <em class="glossterm">XML</em>, JSON, etc.) y 
			en general el modelo cliente-servidor.</p>
			<p>
			Diferentes combinaciones y configuraciones del stack de componentes 
			para <em class="glossterm">aplicaciones web</em> puede ser logrado, sin embargo hay ciertas 
			configuraciones que presentan mayor compatibilidad, es decir que 
			presentan un mayor acople, cohesi&oacute;n y facilidad de configuraci&oacute;n e 
			interoperabilidad; esto depender&aacute; de los componentes elegidos, su 
			tipo, naturaleza, origen y dise&ntilde;o.</p>
			<p>
			Una configuraci&oacute;n de stack de componentes ampliamente usada y con un 
			gran nivel de compatibilidad e interoperabilidad, y por consiguiente 
			f&aacute;cilmente instalable y configurable es la que usa el <a class="glossterm" href="#web server"><em class="glossterm">servidor web</em></a> 
			Apache, el SGBD MySQL, y los lenguajes CGI PHP y Perl, corriendo 
			sobre variados S.O.&#8217;s; esta configuraci&oacute;n de stack de componentes 
			t&iacute;pica es denominada XAMPP, el nombre proviene del acr&oacute;nimo de X 
			(para cualquiera de los diferentes sistemas operativos), Apache, 
			MySQL, PHP, Perl.</p>
			<p>
			XAMPP es el stack de componentes usado para desarrollar y probar la 
			<a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> implementaci&oacute;n de <a class="glossterm" href="#KMap"><em class="glossterm">Mapa de Conocimiento</em></a> modelado 
			presentada, y por lo tanto es la plataforma/arquitectura/stack 
			recomendado para su instalaci&oacute;n y ejecuci&oacute;n.</p>
		</div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1039"></a>Chapter&nbsp;7.&nbsp;
		DESARROLLO DEL PROYECTO</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="#d5e1041">
			INICIO</a></span></dt><dt><span class="section"><a href="#d5e1051">
			PLANEACI&Oacute;N</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e1053">
				ESTRUCTURA DE DESCOMPOSICI&Oacute;N DEL TRABAJO (WBS)</a></span></dt><dt><span class="section"><a href="#d5e1055">
				TABLA DE PRECEDENCIAS</a></span></dt><dt><span class="section"><a href="#d5e1065">
				RUTA CR&Iacute;TICA</a></span></dt><dt><span class="section"><a href="#d5e1077">
				DIAGRAMA DE GANTT</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1089">
			EJECUCI&Oacute;N</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e1091">
				PLANEACI&Oacute;N DE RIESGOS</a></span></dt><dt><span class="section"><a href="#d5e1130">
				CASOS DE USO</a></span></dt><dt><span class="section"><a href="#d5e1186">
				CONSTRUCCI&Oacute;N DE LA ONTOLOG&Iacute;A</a></span></dt><dt><span class="section"><a href="#d5e1578">
				MODELO DE DATOS</a></span></dt><dt><span class="section"><a href="#d5e1597">
				MVC, DIAGRAMAS Y FLUJO SEG&Uacute;N Yii FRAMEWORK</a></span></dt><dt><span class="section"><a href="#d5e1654">
				INSTALACI&Oacute;N, IMPLEMENTACI&Oacute;N Y DESPLIEGUE</a></span></dt><dt><span class="section"><a href="#d5e1723">
				LIBRER&Iacute;AS Y HERRAMIENTAS EXTERNAS</a></span></dt></dl></dd><dt><span class="section"><a href="#d5e1749">
			CONTROL</a></span></dt><dt><span class="section"><a href="#d5e1752">
			CIERRE</a></span></dt></dl></div>
		
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1041"></a>
			INICIO</h2></div></div></div>
			
			<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla01.jpg" align="middle" width="450"></td></tr></table><div class="caption">
					<p>
					Tabla I. CARTA DEL PROYECTO.</p>
				</div></div>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1051"></a>
			PLANEACI&Oacute;N</h2></div></div></div>
			
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1053"></a>
				ESTRUCTURA DE DESCOMPOSICI&Oacute;N DEL TRABAJO (WBS)</h3></div></div></div>
				
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1055"></a>
				TABLA DE PRECEDENCIAS</h3></div></div></div>
				
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla02.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Tabla II. TABLA DE PRECEDENCIAS.</p>
					</div></div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1065"></a>
				RUTA CR&Iacute;TICA</h3></div></div></div>
				
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura09.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 9. Ruta cr&iacute;tica.</p>
					</div></div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1077"></a>
				DIAGRAMA DE GANTT</h3></div></div></div>
				
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura10.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 10. Diagrama de Gantt.</p>
					</div></div>
			</div>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1089"></a>
			EJECUCI&Oacute;N</h2></div></div></div>
			
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1091"></a>
				PLANEACI&Oacute;N DE RIESGOS</h3></div></div></div>
				
				<p>
				Se identifican los riesgos pertinentes al <em class="glossterm">S.I.</em> <em class="glossterm">web</em> de la 
				organizaci&oacute;n en el contexto de la implementaci&oacute;n de <em class="glossterm">KM</em>, definiendo 
				las mitigaciones necesarias para permitir el desarrollo del 
				proyecto &oacute;ptimamente.</p>
				<p>
				La planeaci&oacute;n de riesgos, su definici&oacute;n y mitigaci&oacute;n, garantiza un 
				producto final sostenible y robusto, que cumpla con la 
				funcionalidad esperada y satisfaga a los usuarios finales.</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla03.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Tabla III. RIESGO-01.</p>
					</div></div>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla04.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Tabla IV. RIESGO-02.</p>
					</div></div>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla05.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Tabla V. RIESGO-03.</p>
					</div></div>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla06.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Tabla VI. RIESGO-04.</p>
					</div></div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1130"></a>
				CASOS DE USO</h3></div></div></div>
				
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura11.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 11. Casos de uso.</p>
					</div></div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1142"></a>
					DESCRIPCION DE LOS ACTORES</h4></div></div></div>
					
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla07.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla VII. ACTOR ADMINISTRADOR.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla08.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla VIII. ACTOR USUARIO.</p>
						</div></div>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1160"></a>
					DESCRIPCION DE LOS CASOS DE USO</h4></div></div></div>
					
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla09.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla IX. CASO DE USO LOGIN.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla10.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla X. CASO DE USO CRUD ENTIDADES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla11.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XI. CASO DE USO USAR KMAP ORGANIZACIONAL.</p>
						</div></div>
				</div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1186"></a>
				CONSTRUCCI&Oacute;N DE LA ONTOLOG&Iacute;A</h3></div></div></div>
				
				<p>
				Para el dise&ntilde;o y construcci&oacute;n del <em class="glossterm">M.C.O.</em> (<a class="glossterm" href="#MCO"><em class="glossterm">Modelo de Conocimiento Organizacional</em></a>), que es la estructura que representa un <a class="glossterm" href="#KMap"><em class="glossterm">Mapa de Conocimiento</em></a> con las entidades, jerarqu&iacute;as y relaciones de las 
				entidades de la organizaci&oacute;n, se ha seguido la metodolog&iacute;a OTK 
				(On-To-Knowledge) (Davies et al., 2003; pp. 34), representada en la 
				Figura 12.</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura12.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 12. Pasos de la metodolog&oacute;a on-to-knowledge (OTK).</p>
					</div></div>
				<p>
				A continuaci&oacute;n se exponen las diferentes fases de la metodolog&iacute;a 
				OTK aplicada.</p>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1203"></a>
					ESTUDIO DE FACTIBILIDAD</h4></div></div></div>
					
					<p>
					Como cualquier otro sistema, un sistema de <em class="glossterm">KM</em> s&oacute;lo funcionar&aacute; 
					satisfactoriamente si est&aacute; adecuadamente integrado en la 
					organizacion en la cual va a ser operacional, adem&aacute;s son diversos 
					los factores determinantes del &eacute;xito o fracaso del sistema, es por 
					esto que el estudio de factibilidad identifica &aacute;reas de 
					problemas/oportunidades y soluciones potenciales poniendolas en 
					una perspectiva organizacional amplia, adem&aacute;s sirve como soporte 
					de decisi&oacute;n de factibilidad econ&oacute;mica, t&eacute;cnica y de proyecto, con 
					el fin de seleccionar el &aacute;rea de enfoque y soluci&oacute;n objetivo m&aacute;s 
					adecuadas.</p>
					<p>
					El estudio de factibilidad se ha enfocado en identificar los 
					siguientes tres (3) aspectos referentes a usuarios, casos de uso e 
					interacciones:</p>
					<p>
					Interesados relacionados al proyecto divididos en usuarios del 
					sistema (trabajador de conocimiento) y proveedores del sistema 
					(ingeniero de conocimiento y gestor de conocimiento).</p>
					<p>
					Casos de uso conducidos por usuarios.</p>
					<p>
					Casos de uso conducidos por proveedores del sistema.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura13.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 13. Casos de uso de on-to-knowledge.</p>
						</div></div>
					<p>
					Para el an&aacute;lisis de usuarios y casos de uso durante el estudio de 
					factibilidad, se ha usado la metodolog&iacute;a CommonKADS (ver Figura 
					14.) con las respectivas adaptaciones/modificaciones; esta 
					metodolog&iacute;a ofrece tres (3) modelos para contextualizar y 
					construir el nicho del sistema <em class="glossterm">KM</em>: la organizaci&oacute;n, la actividad y 
					el agente; y el proceso para construir estos modelos consta de los 
					siguientes pasos generales:</p>
					<p>
					Estudio del alcance y problema, consistente en dos (2) 
					partes:</p>
					<p>
					Identificaci&oacute;n de &aacute;reas de problema/oportunidad y soluciones 
					potenciales, y ponerlas en una perspectiva organizacional 
					amplia.</p>
					<p>
					Decidir acerca de factibilidad econ&oacute;mica, t&eacute;cnica y de proyecto 
					para seleccionar el &aacute;rea de enfoque y soluci&oacute;n objetivo m&aacute;s 
					adecuadas.</p>
					<p>
					Estudio de impacto y mejoras, para la soluci&oacute;n objetivo 
					seleccionada, tambi&eacute;n consistente en dos (2) partes:</p>
					<p>
					Recogimiento de datos acerca de las interrelaciones entre 
					actividades de negocio, actores involucrados, y el uso de 
					conocimiento para un desempe&ntilde;o exitoso, y qu&eacute; mejoras podr&iacute;an 
					lograrse aqu&iacute;.</p>
					<p>
					Decidir medidas organizacionales y cambios en actividades, con el 
					fin de asegurar aceptancia organizacional e integraci&oacute;n de un 
					sistema <em class="glossterm">KM</em> soluci&oacute;n.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura14.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 14. Pasos modificados de CommonKADS.</p>
						</div></div>
					<p>
					La metodolog&iacute;a CommonKADS para el modelamiento del contexto 
					organizacional identificando actividades, items de conocimiento y 
					agentes usa unas plantillas (Arab y Shariat, 2010) que facilitan 
					esta tarea.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla12.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XII. OM-1. PROBLEMAS, OPORTUNIDADES, CONTEXTO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla13.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XIII. OM-2. ASPECTOS VARIANTES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla14.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XVI. OM-3. DESCOMPOSICI&Oacute;N DE PROCESO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla15.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XV. OM-4. ITEMS DE CONOCIMIENTO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla16.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XVI. OM-5. JUICIO DE FACTIBILIDAD (DOCUMENTO DE 
							DECISI&Oacute;N).</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla17.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XVII. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-01, CRUD DE 
							PROCESO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla18.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XVIII. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-02, CRUD DE 
							ORGANIZACI&Oacute;N</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla19.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XIX. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-03, CRUD DE 
							COMPETENCIA.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla20.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XX. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-04, CRUD DE CAPITAL 
							ESTRUCTURAL.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla21.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXI. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-05, CRUD DE CAPITAL 
							HUMANO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla22.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXII. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-06, CRUD DE 
							CAPITAL RELACIONAL.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla23.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXIII. TM-1, AN&Aacute;LISIS DE ACTIVIDAD. TASK-07, CRUD DE DEM&Aacute;S 
							ENTIDADES USADAS PARA LA ALIMENTACI&Oacute;N DEL SISTEMA.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla24a.jpg" align="middle" width="450"></td></tr></table></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla24b.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXIV. TM-2, ITEM DE CONOCIMIENTO. KITEM-01, EL PROCESO Y 
							SUS INTERRELACIONES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla25a.jpg" align="middle" width="450"></td></tr></table></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla25b.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXV. TM-2, ITEM DE CONOCIMIENTO. KITEM-02, LA ORGANIZACI&Oacute;N 
							Y SUS INTERRELACIONES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla26a.jpg" align="middle" width="450"></td></tr></table></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla26b.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXVI. TM-2, ITEM DE CONOCIMIENTO. KITEM-03, LA COMPETENCIA 
							Y SUS INTERRELACIONES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla27a.jpg" align="middle" width="450"></td></tr></table></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla27b.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXVII. TM-2, ITEM DE CONOCIMIENTO. KITEM-04, EL CAPITAL Y 
							SUS INTERRELACIONES.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla28a.jpg" align="middle" width="450"></td></tr></table></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla28b.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXVIII. TM-2, ITEM DE CONOCIMIENTO. KITEM-05, RECURSOS 
							ESPEC&Iacute;FICOS DE LA ORGANIZACI&Oacute;N.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla29.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXIX. AM-1, HOJA DE AGENTE. TRABAJADOR DE 
							CONOCIMIENTO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla30.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXX. AM-1, HOJA DE AGENTE. INGENIERO DE 
							CONOCIMIENTO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla31.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXXI. AM-1, HOJA DE AGENTE. GESTOR DE CONOCIMIENTO.</p>
						</div></div>
					<p>
					Con base en el estudio de factibilidad realizado, y dada una 
					decisi&oacute;n de seguir adelante con la implementaci&oacute;n del sistema <em class="glossterm">KM</em>, 
					este estudio servir&aacute; como entrada para la siguiente fase, Inicio 
					de la <em class="glossterm">Ontolog&iacute;a</em>.</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1434"></a>
					FASE INICIAL</h4></div></div></div>
					
					<p>
					Similar al desarrollo de software en general, empezamos con un 
					documento de especificaci&oacute;n de requerimientos de <em class="glossterm">ontolog&iacute;a</em> (ORSD). 
					En general describe qu&eacute; debe soportar una <em class="glossterm">ontolog&iacute;a</em>, bosquejar el 
					area planeada de aplicaci&oacute;n de la <em class="glossterm">ontolog&iacute;a</em> y listar, por ejemplo, 
					fuentes valuables de conocimiento. Contiene un conjunto de 
					estructuras relevantes del dominio. El ORSD deber&iacute;a guiar un 
					ingeniero <em class="glossterm">ontol&oacute;gico</em> en decidir acerca de la inclusion y exclusion 
					de conceptos/relaciones y la estructura jerarquica de la 
					<em class="glossterm">ontolog&iacute;a</em>.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla32.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXXII. DOCUMENTO DE ESPECIFICACI&Oacute;N DE REQUERIMIENTOS DE 
							ONTOLOG&Iacute;A (ORSD).</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="tablas/tabla33.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Tabla XXXIII. PREGUNTAS DE COMPETENCIAS (CQ-1).</p>
						</div></div>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1458"></a>
					FASE DE REFINAMIENTO</h4></div></div></div>
					
					<p>
					El fin de la fase de refinamiento es producir una <em class="glossterm">ontolog&iacute;a</em> 
					objetivo madura y orientada a la aplicaci&oacute;n acorde con la 
					especificaci&oacute;n dada por la fase inicial. Con base en los modelos 
					de organizaci&oacute;n, actividad y agente analizados con la metodolog&iacute;a 
					CommonKADS, se ha bosquejado la jerarqu&iacute;a de conceptos en forma de 
					mapa mental como se muestra en la figura.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura15.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 15. Modelo de conocimiento organizacional.</p>
						</div></div>
					<p>
					Con la <em class="glossterm">ontolog&iacute;a</em> bosquejada se procede a implementarla en lenguaje 
					<em class="glossterm">RDF</em> usando la sintaxis abreviada Turtle y un serializador que 
					posteriormente convierte esta sintaxis a <em class="glossterm">RDF</em> nativo y validable en 
					cualquier validador.</p>
					<p>
					Fragmentos de los documentos Turtle:</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura16.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 16. Fragmento de c&oacute;digo turtle del MCO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura17.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 17. Fragmento de c&oacute;digo turtle de la definici&oacute;n de 
							clases.</p>
						</div></div>
					<p>
					Usando la herramienta rapper de las Librer&iacute;as <em class="glossterm">RDF</em> Redland se 
					parsea el documento Turtle para obtener el documento <em class="glossterm">RDF</em> 
					des-serializado nativo como se aprecia.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura18.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 18. Herramienta rapper para obtener el documento RDF 
							correspondiente al MCO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura19.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 19. Herramienta rapper para obtener el documento RDF 
							correspondiente a la definici&oacute;n de clases.</p>
						</div></div>
					<p>
					El documento <em class="glossterm">RDF</em> obtenido utiliza t&eacute;rminos <em class="glossterm">RDFS</em> y es validable en 
					cualquier validador como se aprecia.</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura20.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 20. Validaci&oacute;n del documento RDF correspondiente al 
							MCO.</p>
						</div></div>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura21.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 21. Validaci&oacute;n del documento RDF correspondiente a la 
							definici&oacute;n de clases.</p>
						</div></div>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1543"></a>
					FASE DE EVALUACI&Oacute;N</h4></div></div></div>
					
					<p>
					Verificar el estado, validez y utilidad de la <em class="glossterm">ontolog&iacute;a</em> constru&iacute;da 
					implica analizarla en un marco que incluye requerimientos, 
					especificaciones, preguntas de competencias y/o el mundo real. 
					Implica hacer un juicio de las <em class="glossterm">ontolog&iacute;as</em>, el ambiente de software 
					asociado y la documentaci&oacute;n con respecto a un marco de 
					referencias; retroalimentaci&oacute;n de la fase de refinamiento; y una 
					evaluaci&oacute;n sistmatica que conduce a un nivel de calidad 
					consistente de la ontlog&iacute;a y aceptaci&oacute;n en la organizaci&oacute;n.</p>
					<p>
					La evaluaci&oacute;n debe enfocarse en tres (3) aspectos 
					principales:</p>
					<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
							<p>
							Enfocada en la tecnolog&iacute;a: propiedades de las <em class="glossterm">ontolog&iacute;as</em> 
							generadas por las herramientas de desarrollo (conformidad de 
							lenguaje, consistencia, etc.), y propiedades tecnol&oacute;gicas 
							(interoperabilidad, escalabilidad, alojamiento en memoria, 
							etc.).</p>
						</li><li class="listitem">
							<p>
							Enfocada en el usuario: conformidad con ORSD (ver Tabla XXXII.), 
							conformidad con preguntas de competencia (ver Tabla XXXIII.), y 
							patrones de uso.</p>
						</li><li class="listitem">
							<p>
							Enfocada en la <em class="glossterm">ontolog&iacute;a</em>: metodolog&iacute;as formales de evaluaci&oacute;n de 
							<em class="glossterm">ontolog&iacute;as</em>.</p>
						</li></ul></div>
					<p>
					Al comparar la <em class="glossterm">ontolog&iacute;a</em> modelada con el ORSD (ver Tabla XXXII.) 
					se observa que la <em class="glossterm">ontolog&iacute;a</em> satisface los lineamientos 
					establecidos en el documento, por otra parte la aplicaci&oacute;n basada 
					en la <em class="glossterm">ontolog&iacute;a</em> debe soportar o responder las preguntas de 
					competencias analizadas previamente (ver Tabla XXXIII.); con una 
					primera inspecci&oacute;n se observa que la <em class="glossterm">ontolog&iacute;a</em> modelada est&aacute; en 
					capacidad de responder estas preguntas, sin embargo es en la etapa 
					posterior de integraci&oacute;n con la aplicaci&oacute;n final donde realmente 
					se observa esta capacidad.</p>
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1564"></a>
					FASE DE MANTENIMIENTO Y EVOLUCI&Oacute;N</h4></div></div></div>
					
					<p>
					El mantenimiento y evoluci&oacute;n de una aplicaci&oacute;n basada en <em class="glossterm">ontolog&iacute;a</em> 
					es primariamente un proceso organizacional. Acorde a su rol es el 
					Ingeniero de Conocimiento el actor encargado de modificar la 
					<em class="glossterm">ontolog&iacute;a</em>, sin embargo deben programarse los intervalos en que los 
					mantenimientos se har&aacute;n con su respectiva monitorizaci&oacute;n, pruebas 
					y an&aacute;lisis de efectos colaterales. De igual forma debe existir una 
					integraci&oacute;n entre el equipo de <em class="glossterm">TI</em> encargado de la aplicaci&oacute;n 
					basada en la <em class="glossterm">ontolog&iacute;a</em> y el equipo de <em class="glossterm">KM</em>.</p>
					<p>
					La aplicaci&oacute;n soportando la <em class="glossterm">ontolog&iacute;a</em> debe adaptarse a un entorno 
					cambiante, as&iacute; como la misma <em class="glossterm">ontolog&iacute;a</em> debe adaptarse tambi&eacute;n 
					(evoluci&oacute;n de la <em class="glossterm">ontolog&iacute;a</em>). Los aspectos a evolucionar son la 
					extensi&oacute;n de la <em class="glossterm">ontolog&iacute;a</em> por medio de nuevas entradas l&eacute;xicas, 
					cambio del significado de las entradas l&eacute;xicas, o que partes de la 
					<em class="glossterm">ontolog&iacute;a</em> se vuelvan obsoloetas (no se necesiten m&aacute;s).</p>
				</div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1578"></a>
				MODELO DE DATOS</h3></div></div></div>
				
				<p>
				Con base en la jerarqu&iacute;a de conceptos y clases modelada por la 
				<em class="glossterm">ontolog&iacute;a</em>, se plantea el siguiente modelo de datos para implementar 
				la BD que refleje los conceptos a los que apunta la 
				<em class="glossterm">ontolog&iacute;a</em>.</p>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1583"></a>
					RESTRICCIONES SEM&Aacute;NTICAS</h4></div></div></div>
					
				</div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1585"></a>
					MODELO RELACIONAL</h4></div></div></div>
					
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura22.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 22. Modelo relacional.</p>
						</div></div>
				</div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1597"></a>
				MVC, DIAGRAMAS Y FLUJO SEG&Uacute;N Yii FRAMEWORK</h3></div></div></div>
				
				<p>
				Debido a la implementaci&oacute;n de POO y al enfoque total en el patr&oacute;n 
				de dise&ntilde;o MVC (Model View Controller), los t&iacute;picos diagramas UML de 
				clases y flujo de aplicaci&oacute;n quedan mejor representados con la 
				estructura est&aacute;tica y flujo del <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> con base en los modelos, 
				controladores y vistas generados a partir del modelo de datos y su 
				implementaci&oacute;n en la base de datos.</p>
				<p>
				De la p&aacute;gina Modelo-Vista-Controlador (Model-View-Controller MVC) 
				de la gu&iacute;a de Yii 
				(<a class="ulink" href="http://www.yiiframework.com/doc/guide/1.1/es/basics.mvc" target="_top">http://www.yiiframework.com/doc/guide/1.1/es/basics.mvc</a>) (Yii 
				Framework, 2012) se tiene que Yii implementa el dise&ntilde;o de patron 
				modelo-vista controlador (model-view-controller MVC) el cual es 
				adoptado ampliamente en la programaci&oacute;n <em class="glossterm">Web</em>. MVC tiene por objeto 
				separar la l&oacute;gica del negocio de las consideraciones de la interfaz 
				de usuario para que los desarrolladores puedan modificar cada parte 
				m&aacute;s f&aacute;cilmente sin afectar a la otra. En MVC el modelo representa 
				la informaci&oacute;n (los datos) y las reglas del negocio; la vista 
				contiene elementos de la interfaz de usuario como textos, 
				formularios de entrada; y el controlador administra la comunicaci&oacute;n 
				entre la vista y el modelo.</p>
				<p>
				M&aacute;s alla del MVC, Yii tambien introduce un front-controller llamado 
				aplicaci&oacute;n el cual representa el contexto de ejecuci&oacute;n del 
				procesamiento del pedido. La aplicaci&oacute;n resuelve el pedido del 
				usuario y la dispara al controlador apropiado para tratamiento 
				futuro.</p>
				<p>
				El siguiente diagrama muestra la estructura est&aacute;tica de una 
				aplicaci&oacute;n Yii.</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura23.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 23. Estructura est&aacute;tica de aplicaci&oacute;n Yii.</p>
					</div></div>
				<div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e1616"></a>
					Un flujo de tareas t&iacute;pico</h4></div></div></div>
					
					<p>
					El siguiente diagrama muestra un t&iacute;pico flujo de tareas de una 
					aplicaci&oacute;n Yii cuando resuelve un pedido de usuario:</p>
					<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura24.jpg" align="middle" width="450"></td></tr></table><div class="caption">
							<p>
							Figura 24. Un t&iacute;pico flujo de tareas de una aplicaci&oacute;n 
							Yii.</p>
						</div></div>
					<div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem">
							<p>
							Un usuario realiza un pedido con la siguiente URL 
							http://www.example.com/index.php?r=post/show&amp;id=1 y el 
							<a class="glossterm" href="#web server"><em class="glossterm">servidor Web</em></a> se encarga de la solicitud mediante la ejecuci&oacute;n 
							del script de arranque en index.php.</p>
						</li><li class="listitem">
							<p>
							El script de entrada crea una instancia de applicaci&oacute;n y la 
							ejecuta.</p>
						</li><li class="listitem">
							<p>
							La aplicaci&oacute;n obtiene la informaci&oacute;n detallada del pedido del 
							usuario del componente de aplicaci&oacute;n request.</p>
						</li><li class="listitem">
							<p>
							El controlador determina le controlador y la acci&oacute;n pedido con 
							ayuda del componente de aplicaci&oacute;n llamado urlManager. Para este 
							ejemplo el controlador es post que refiere a la clase 
							PostController y la acci&oacute;n es show que su significado es 
							determinado por el controlador.</p>
						</li><li class="listitem">
							<p>
							La aplicaci&oacute;n crea una instancia del controlador pedido para 
							resolver el pedido del usuario. El controlador determina que la 
							acci&oacute;n show refiere al nombre de m&eacute;todo actionShow en la clase 
							controlador. Entonces crea y ejecuta los filtros asociados con 
							esta acci&oacute;n (ejemplo: control de acceso, benchmarking). La 
							acci&oacute;n es ejecutado si los filtros lo permiten.</p>
						</li><li class="listitem">
							<p>
							La acci&oacute;n lee el modelo Post cuyo ID es 1 de la base de 
							datos.</p>
						</li><li class="listitem">
							<p>
							La acci&oacute;n realiza la vista llamada show con el modelo 
							Post.</p>
						</li><li class="listitem">
							<p>
							La vista lee y muestra los atributos del modelo Post.</p>
						</li><li class="listitem">
							<p>
							La vista ejecuta algunos widgets.</p>
						</li><li class="listitem">
							<p>
							El resultado realizado es embebido en un esquema (layout).</p>
						</li><li class="listitem">
							<p>
							La acci&oacute;n completa la vista realizada y se la muestra al 
							usuario.</p>
						</li></ol></div>
					<p>
					Es decir que por cada una de las tablas de la BD, este flujo se 
					cumple dependiendo de la entidad en cuesti&oacute;n.</p>
				</div>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1654"></a>
				INSTALACI&Oacute;N, IMPLEMENTACI&Oacute;N Y DESPLIEGUE</h3></div></div></div>
				
				<p>
				La instalaci&oacute;n de Yii Framework se realiza siguiendo los pasos 
				b&aacute;sicos indicados en el sitio <a class="ulink" href="http://www.yiiframework.com/tour/" target="_top">http://www.yiiframework.com/tour/</a>, 
				que como se aprecia son los siguientes:</p>
				<p>
				Yii fue dise&ntilde;ado con la construcci&oacute;n de <em class="glossterm">aplicaciones Web</em> en mente. 
				Este es un vistazo al proceso de desarrollo de Yii para crear 
				<em class="glossterm">aplicaciones Web</em> que manejan bases de datos.</p>
				<p>
				Paso 0. Preparaci&oacute;n</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura25.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 25. Esqueleto por defecto de aplicaci&oacute;n Yii.</p>
					</div></div>
				<p>
				Despu&eacute;s de descargar e instalar Yii Framework, ejecutar un simple 
				comando de consola para generar un esqueleto de <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n Web</em></a> 
				constru&iacute;da con Yii. La aplicaci&oacute;n es totalmente funcional, con 
				buenas caracter&iacute;sticas incluyendo login de usuario y formulario de 
				contacto. Es un buen punto de partida para implementar 
				caracter&iacute;sticas m&aacute;s sofisticadas.</p>
				<p>
				Paso 1. Crear la Base de Datos</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura26.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 26. Ejemplo de sentencia SQL DDL para la creaci&oacute;n de tabla 
						de BD.</p>
					</div></div>
				<p>
				Aunque Yii puede virtualmente eliminar las tareas de codificaci&oacute;n 
				m&aacute;s repetitivas, el desarrollador es responsable por el trabajo 
				creativo real. Esto frecuentemente empieza con el dise&ntilde;o de todo el 
				sistema a construir, en t&eacute;rminos de alg&uacute;n esquema de base de 
				datos.</p>
				<p>
				Paso 2a. Yii Genera las Clases Modelo</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura27.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 27. Generador gii de modelos.</p>
					</div></div>
				<p>
				Ahora es el turno de Yii de transformar el esquema de base de datos 
				en c&oacute;digo PHP funcional. Usando el generador de c&oacute;digo basado en 
				<em class="glossterm">Web</em> prove&iacute;do, las definiciones de tablas de base de datos se pueden 
				volver clases modelo instant&aacute;neamente, sin escribir una sola l&iacute;nea 
				de c&oacute;digo. Las clases modelo permitir&aacute;n acceder la base de datos de 
				una manera orientada a objetos.</p>
				<p>
				Paso 2b. Yii Genera el C&oacute;digo CRUD</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura28.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 28. Generador gii de c&oacute;digo CRUD.</p>
					</div></div>
				<p>
				Usando el generador de c&oacute;digo mencionado, se puede adem&aacute;s generar 
				c&oacute;digo que implementa las caracter&iacute;sticas CRUD (crear, leer, 
				actualizar, eliminar) t&iacute;picas para las tablas de base de datos 
				seleccionadas. El c&oacute;digo generado es altamente usable y 
				personalizable, siguiendo un bien adoptado patr&oacute;n de dise&ntilde;o MVC 
				(modelo-vista-controlador). De nuevo, Yii hace todo el trabajo 
				sucio sin necesidad de escribir una sola l&iacute;nea de c&oacute;digo.</p>
				<p>
				Paso 3. Personalizar el c&oacute;digo seg&uacute;n las necesidades</p>
				<div class="mediaobject" align="center"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="450"><tr><td align="center"><img src="figuras/figura29.jpg" align="middle" width="450"></td></tr></table><div class="caption">
						<p>
						Figura 29. Personalizaci&oacute;n del c&oacute;digo.</p>
					</div></div>
				<p>
				Finalmente se necesita personalizar el c&oacute;digo seg&uacute;n las necesidades 
				exactas.</p>
			</div>
			<div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e1723"></a>
				LIBRER&Iacute;AS Y HERRAMIENTAS EXTERNAS</h3></div></div></div>
				
				<p>
				Para complementar la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> y completar todas las 
				funcionalidades disponibles se han usado algunas librer&iacute;as, 
				herramientas, software y dem&aacute;s de terceros, a continuaci&oacute;n se 
				mencionan las principales.</p>
				<p>
				ARC <em class="glossterm">RDF</em> Classes for PHP</p>
				<p>
				ARC2 es una librer&iacute;a PHP 5.3 para trabajar con <em class="glossterm">RDF</em>. Tambi&eacute;n provee 
				un triple-store basado en MySQL con soporte SPARQL. Es un sistema 
				<em class="glossterm">RDF</em> flexible para practicantes de <a class="glossterm" href="#SW"><em class="glossterm">web sem&aacute;ntica</em></a> y PHP. Es libre, de 
				<a class="glossterm" href="#open source"><em class="glossterm">c&oacute;digo abierto</em></a>, f&aacute;cil de usar, y corre en la mayor&iacute;a de entornos de 
				<a class="glossterm" href="#web server"><em class="glossterm">servidor web</em></a>.</p>
				<p>
				Usada como el triple-store para alimentar la <em class="glossterm">ontolog&iacute;a</em> a medida que 
				se introducen o modifican datos de los modelos v&iacute;a la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> y sus formularios CRUD.</p>
				<p>
				Arbor.js</p>
				<p>
				Arbor es una librer&iacute;a de visualizaci&oacute;n de grafos constru&iacute;da con web 
				workers y jQuery. M&aacute;s que tratar de ser un <a class="glossterm" href="#framework"><em class="glossterm">framework</em></a> que todo lo 
				abarca, arbor provee un algoritmo eficiente de disposici&oacute;n de 
				fuerza dirigida m&aacute;s abstracciones para organizaci&oacute;n de grafos y 
				manejo de refrescamiento de pantalla.</p>
				<p>
				Usada para la vista de grafo de las tripletas de una entidad de la 
				<a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a>.</p>
				<p>
				Fancybox</p>
				<p>
				Fancybox es una herramienta para desplegar im&aacute;genes, <em class="glossterm">html</em> y 
				multimedia en un estilo Mac &#8220;lightbox&#8221; que flota por encima de la 
				<a class="glossterm" href="#web page"><em class="glossterm">p&aacute;gina web</em></a>.</p>
				<p>
				Usada para mostrar mensajes y vistas emergentes como las diferentes 
				opciones de visualizaci&oacute;n de una entidad que ofrece la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a>.</p>
			</div>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1749"></a>
			CONTROL</h2></div></div></div>
			
			<p>
			El control llevado a cabo durante el desarrollo del proyect&oacute; 
			consisti&oacute; en la revisi&oacute;n de los diferentes hitos planeados con el 
			Diagrama de Gantt en conjunci&oacute;n con las reuniones de revisi&oacute;n 
			realizadas.</p>
		</div>
		<div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e1752"></a>
			CIERRE</h2></div></div></div>
			
			<p>
			El cierre del proyecto se trata del presente informe final, en 
			conjunto con la sustentaci&oacute;n del trabajo realizado, los entregables 
			y en general los resultados obtenidos que se describen en el 
			presente informe.</p>
		</div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1755"></a>Chapter&nbsp;8.&nbsp;
		RESULTADOS</h1></div></div></div>
		
		<p>
		Habiendo bosquejado una jerarqu&iacute;a de conceptos y clases que describen 
		los recursos organizacionales en un nivel t&aacute;ctico y estrat&eacute;gico de la 
		pir&aacute;mide de jerarqu&iacute;a organizacional, lo que se ha denominado el <em class="glossterm">MCO (Modelo de Conocimiento Organizacional)</em> 
		, se ha elegido un lenguaje 
		apropiado para representar este conocimiento implement&aacute;ndose una 
		<em class="glossterm">ontolog&iacute;a</em>.</p>
		<p>
		Se han elegido las herramientas y arquitectura adecuadas para 
		implementar y soportar la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> basada en la <em class="glossterm">ontolog&iacute;a</em> 
		modelada y se ha implementado la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> est&aacute;ndar que 
		soportar&aacute; la <em class="glossterm">ontolog&iacute;a</em> modelada.</p>
		<p>
		La integraci&oacute;n de estas dos (2) caracter&iacute;sticas en un solo <em class="glossterm">S.I.</em> es lo 
		que da como resultado un <a class="glossterm" href="#KMap"><em class="glossterm">Mapa de Conocimiento</em></a> sobre plataforma <em class="glossterm">web</em> 
		con enfoque en <a class="glossterm" href="#KM"><em class="glossterm">Gesti&oacute;n de Conocimiento</em></a> Organizacional.</p>
		<p>
		Como hitos o tangibles del proyecto se tienen los siguientes:</p>
		<div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
				<p>
				Paquete para instalaci&oacute;n y despliegue de la <a class="glossterm" href="#WebApp"><em class="glossterm">aplicaci&oacute;n web</em></a> 
				funcional.</p>
			</li><li class="listitem">
				<p>
				Manual y documentaci&oacute;n t&eacute;cnica.</p>
			</li><li class="listitem">
				<p>
				Manual y documentaci&oacute;n de usuario.</p>
			</li></ul></div>
	</div>
	<div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1779"></a>Chapter&nbsp;9.&nbsp;
		CONCLUSIONES</h1></div></div></div>
		
		<p>
		El complejo flujo de informaci&oacute;n y el acelerado avance de las <em class="glossterm">T.I.</em> 
		hacen que las organizaciones se releguen ante los actuales y nuevos 
		retos que deben enfrentar, y provoca que disciplinas fundamentales en 
		el &eacute;xito organizacional y en el cumpliminiento de visi&oacute;n, misi&oacute;n y 
		objetivos como la <em class="glossterm">Gesti&oacute;n del Conocimiento</em> y la <em class="glossterm">Gesti&oacute;n Tecnol&oacute;gica</em> 
		sean pobremente ejecutadas; adem&aacute;s como muestra claramente La Cadena 
		de Transformaci&oacute;n de la Informaci&oacute;n y como expresa la m&aacute;xima 
		&#8220;Conocimiento es Poder&#8221;, el conocimiento es y debe ser el activo 
		fundamental, original y propio de una organizaci&oacute;n y lo que le da su 
		identidad frente a las dem&aacute;s.</p>
		<p>
		De aqu&iacute; radica la importancia de ejercer una <em class="glossterm">Gesti&oacute;n del Conocimiento</em> 
		que est&eacute; acorde con las tecnolog&iacute;as y est&aacute;ndares m&aacute;s avanzados que 
		puedan proveer y suplir las funcionalidades y requerimientos 
		necesarios sin atrasar el avance tecnol&oacute;gico de la 
		organizaci&oacute;n.</p>
		<p>
		Recurrir a tecnolog&iacute;as y est&aacute;ndares <em class="glossterm">web</em> actuales en conjunto con 
		t&eacute;cnicas de Ingenier&iacute;a del Conocimiento y Representaci&oacute;n del 
		Conocimiento para modelar este dominio de conceptos y clases que 
		conciernen a una organizaci&oacute;n se presenta como un enfoque adecuado 
		para cubrir las principales necesidades de <a class="glossterm" href="#KM"><em class="glossterm">Gesti&oacute;n de Conocimiento</em></a> 
		Organizacional con un enfoque de plataforma convencional como es la 
		<em class="glossterm">web</em>.</p>
	</div>
	<div class="bibliography"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1791"></a>BIBLIOGRAF&Iacute;A</h1></div></div></div>
		
		<div class="bibliomixed"><a name="d5e1793"></a><p class="bibliomixed">
			<span class="bibliomset">
				Davies, Jhon; Fensel, Dieter y Harmelen, Frank V.
				<i>Towards the Semantic Web. Ontology-Driven Knowledge 
				Management</i>.
				<span class="publishername">John Wiley &amp; Sons, Ltd.</span>
				Inglaterra (<span class="pubdate">2003</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1798"></a><p class="bibliomixed">
			<span class="bibliomset">
				Yu, Liyang.
				<i>Introduction to the Semantic Web and Semantic Web Services</i>.
				<span class="publishername">Taylor &amp; Francis Group, LLC.</span>
				Boca Raton, Estados Unidos (<span class="pubdate">2007</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1803"></a><p class="bibliomixed">
			<span class="bibliomset">
				Daconta, Michael C.; Obrst, Leo J. y Smith, Kevin T.
				<i>The Semantic Web. A Guide to the Future of XML, Web Services, and Knowledge Management</i>.
				<span class="publishername">Wiley Publishing, Inc.</span>
				Indianapolis, Estados Unidos (<span class="pubdate">2003</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1808"></a><p class="bibliomixed">
			<span class="bibliomset">
				Russel, Stuart y Norvig, Peter.
				<i>Inteligencia Artificial. Un enfoque moderno</i>(2a. ed.).
				<span class="publishername">PEARSON EDUCACI&Oacute;N, S.A.</span>
				Madrid, Espa&ntilde;a (<span class="pubdate">2004</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1813"></a><p class="bibliomixed">
			<span class="bibliomset">
				Antoniou, Grigoris y van Harmelen, Frank
				<i>A Semantic Web primer</i>(2a. ed.).
				<span class="publishername">The MIT Press.</span>
				Estados Unidos (<span class="pubdate">2008</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1818"></a><p class="bibliomixed">
			<span class="bibliomset">
				Pollock, Jeffrey T.
				<i>Semantic Web For Dummies</i>.
				<span class="publishername">Wiley Publishing, Inc.</span>
				Indian&aacute;polis (Indiana), Estados Unidos (<span class="pubdate">2009</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1823"></a><p class="bibliomixed">
			<span class="bibliomset">
				Paniagua A., Enrique (coordinador); L&oacute;pez A., Bel&eacute;n; et al.
				<i>La gesti&oacute;n tecnol&oacute;gica del conocimiento</i>.
				<span class="publishername">Servicio de Publicaciones</span>.
				Murcia, Espa&ntilde;a: Universidad de Murcia (<span class="pubdate">2007</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1828"></a><p class="bibliomixed">
			<span class="bibliomset">
				Galvis P., Jair.
				<i>Mapas de Conocimiento como una herramienta de apoyo para la gesti&oacute;n del conocimiento</i>.
				Revista InteracTIC, Nro. <span class="issuenum">09</span> A&ntilde;o 01.
				<span class="publishername">CINTEL (Centro de Investigaci&oacute;n de las Telecomunicaciones).</span>
				(<span class="pubdate">2003</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1834"></a><p class="bibliomixed">
			<span class="bibliomset">
				Rivero, S. (<span class="pubdate">S.F.</span>).
				<i>Mapas de conocimiento y repositorios de conocimiento estructural</i>.
				En CARBALLO, R. et. al. (<span class="pubdate">2006</span>).
				<i>Innovaci&oacute;n y gesti&oacute;n del conocimiento modelo, metodolog&iacute;a, sistemas y herramientas de innovaci&oacute;n</i>.
				<span class="publishername">D&iacute;az de Santos</span>.
				Espa&ntilde;a.
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1841"></a><p class="bibliomixed">
			<span class="bibliomset">
				UNIVERSIDAD EAFIT. (<span class="pubdate">S.F.</span>).
				<i>Mapas del conocimiento: c&oacute;mo representar el conocimiento</i>.
				Recuperado de <a class="ulink" href="http://atlas.eafit.edu.co:8001/servlet/SBReadResourceServlet?rid=1165431697343_1597434583_818&amp;partName=htmltext" target="_top">http://atlas.eafit.edu.co:8001/servlet/SBReadResourceServlet?rid=1165431697343_1597434583_818&amp;partName=htmltext</a>, el 19 de julio de 2012.
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1846"></a><p class="bibliomixed">
			<span class="bibliomset">
				P&eacute;rez, D. &amp; Dressler M. (<span class="pubdate">2007</span>).
				<i>Tecnolog&iacute;as de la informaci&oacute;n para la gesti&oacute;n del conocimiento</i>.
				Recuperado de <a class="ulink" href="http://www.intangiblecapital.org/index.php/ic/article/viewFile/12/18" target="_top">http://www.intangiblecapital.org/index.php/ic/article/viewFile/12/18</a>, el 19 de julio de 2012.
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1851"></a><p class="bibliomixed">
			<span class="bibliomset">
				Arab M., Alireza y Shariat Z., Navid.
				<i>Design and Development of a Maintenance Knowledge-Base System Based on CommonKADS Methodology</i>.
				<span class="publishername">Royal Institute of Technology, School of Industrial Engineering and Management, Department Production Engineering and Management</span>.
				Estocolmo, Suecia (<span class="pubdate">2010</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1856"></a><p class="bibliomixed">
			<span class="bibliomset">
				AIFB.
				<i>Methodology for Ontology Development</i>.
				<span class="publishername">Institut AIFB, Universit&auml;t Karlsruhe</span>.
				Alemania (<span class="pubdate">2004</span>).
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1861"></a><p class="bibliomixed">
			<span class="bibliomset">
				Hern&aacute;ndez, Sandra M. y Zuluaga, Paula A. (<span class="pubdate">2008</span>).
				<i>WEB SERVICE</i>.
				Presentaci&oacute;n digital. Manizales, Colombia.
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1865"></a><p class="bibliomixed">
			<span class="bibliomset">
				Marulanda E., Carlos E. (<span class="pubdate">2009</span>).
				<i>GESTI&Oacute;N DE PROYECTOS</i>.
				Presentaci&oacute;n digital. Manizales, Colombia.
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1869"></a><p class="bibliomixed">
			<span class="bibliomset">
				Yii Framework (<span class="pubdate">2012</span>).
				<i>Modelo-Vista-Controlador (Model-View-Controller MVC)</i>.
				Recuperado en Octubre 15 de 2012, desde <a class="ulink" href="http://www.yiiframework.com/doc/guide/1.1/es/basics.mvc" target="_top">http://www.yiiframework.com/doc/guide/1.1/es/basics.mvc</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1874"></a><p class="bibliomixed">
			<span class="bibliomset">
				Yii Framework (<span class="pubdate">2012</span>).
				<i>Take the Tour</i>.
				Recuperado en Octubre 15 de 2012, desde <a class="ulink" href="http://www.yiiframework.com/tour/" target="_top">http://www.yiiframework.com/tour/</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1879"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Gesti&oacute;n del conocimiento</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Gesti%C3%B3n_del_conocimiento" target="_top">http://es.wikipedia.org/wiki/Gesti%C3%B3n_del_conocimiento</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1884"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Knowledge management</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://en.wikipedia.org/wiki/Knowledge_management" target="_top">http://en.wikipedia.org/wiki/Knowledge_management</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1889"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Sistema de informaci&oacute;n</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Sistema_de_informaci%C3%B3n" target="_top">http://es.wikipedia.org/wiki/Sistema_de_informaci%C3%B3n</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1894"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Tecnolog%C3%ADas_de_la_informaci%C3%B3n_y_la_comunicaci%C3%B3n" target="_top">http://es.wikipedia.org/wiki/Tecnolog%C3%ADas_de_la_informaci%C3%B3n_y_la_comunicaci%C3%B3n</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1899"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>P&aacute;gina web</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/P%C3%A1gina_web" target="_top">http://es.wikipedia.org/wiki/P%C3%A1gina_web</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1904"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Sitio web</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Sitio_web" target="_top">http://es.wikipedia.org/wiki/Sitio_web</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1909"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>World Wide Web</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/World_Wide_Web" target="_top">http://es.wikipedia.org/wiki/World_Wide_Web</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1914"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Tim Berners-Lee</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Tim_Berners-Lee" target="_top">http://es.wikipedia.org/wiki/Tim_Berners-Lee</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1919"></a><p class="bibliomixed">
			<span class="bibliomset">
				Tim Berners-Lee (<span class="pubdate">1989</span>).
				<i>Information Management: A Proposal</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://www.w3.org/History/1989/proposal.html" target="_top">http://www.w3.org/History/1989/proposal.html</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1924"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/CERN" target="_top">http://es.wikipedia.org/wiki/CERN</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1929"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Web sem&aacute;ntica</i>.
				Recuperado en Julio 17 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Web_Sem%C3%A1ntica" target="_top">http://es.wikipedia.org/wiki/Web_Sem&aacute;ntica</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1934"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>SGML</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/SGML" target="_top">http://es.wikipedia.org/wiki/SGML</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1939"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>HTML</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/HTML" target="_top">http://es.wikipedia.org/wiki/HTML</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1944"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Extensible Markup Language</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/XML" target="_top">http://es.wikipedia.org/wiki/XML</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1949"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2009, 2 de octubre</span>).
				<i>XML Schema</i>.
				Recuperado en Julio 17 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/XML_Schema" target="_top">http://es.wikipedia.org/wiki/XML_Schema</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1954"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>XHTML</i>.
				Recuperado en Julio 17 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/XHTML" target="_top">http://es.wikipedia.org/wiki/XHTML</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1959"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Resource Description Framework</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Resource_Description_Framework" target="_top">http://es.wikipedia.org/wiki/Resource_Description_Framework</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1964"></a><p class="bibliomixed">
			<span class="bibliomset">
				W3C (<span class="pubdate">2004</span>).
				<i>Resource Description Framework (RDF)</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://www.w3.org/RDF/" target="_top">http://www.w3.org/RDF/</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1969"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>RDF Schema</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/RDF_Schema" target="_top">http://es.wikipedia.org/wiki/RDF_Schema</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1974"></a><p class="bibliomixed">
			<span class="bibliomset">
				W3C (<span class="pubdate">2004</span>).
				<i>RDF Vocabulary Description Language 1.0: RDF Schema</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://www.w3.org/TR/rdf-schema/" target="_top">http://www.w3.org/TR/rdf-schema/</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1979"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2012</span>).
				<i>Ontolog&iacute;a (inform&aacute;tica)</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/Ontolog%C3%ADa_(inform%C3%A1tica)" target="_top">http://es.wikipedia.org/wiki/Ontolog%C3%ADa_(inform%C3%A1tica)</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1984"></a><p class="bibliomixed">
			<span class="bibliomset">
				Wikipedia (<span class="pubdate">2009, 4 de julio</span>).
				<i>OWL</i>.
				Recuperado en Julio 17 de 2012, desde <a class="ulink" href="http://es.wikipedia.org/wiki/OWL" target="_top">http://es.wikipedia.org/wiki/OWL</a>
			</span>
		</p></div>
		<div class="bibliomixed"><a name="d5e1989"></a><p class="bibliomixed">
			<span class="bibliomset">
				W3C (<span class="pubdate">2004</span>).
				<i>OWL Web Ontology Language</i>.
				Recuperado en Septiembre 26 de 2012, desde <a class="ulink" href="http://www.w3.org/TR/owl-ref/" target="_top">http://www.w3.org/TR/owl-ref/</a>
			</span>
		</p></div>
	</div>
</div></body></html>